[
    {
        "headline": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Hess-Beats-Q3-Earnings-Estimates-On-Robust-Guyana-Output.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Coal power provides the cheap… Alex Kimani Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Leading U.S. shale operator,Hess Corp.(NYSE:HES), haspostedyet another impressive earnings report, with its stake in prolific Guyana helping it exceed estimates. Hess reported Q3 2024 non-GAAP EPS of $2.14, beating the Wall Street consensus by $0.37 while revenue of $3.2B (+12.7% Y/Y) beat by $160M. The company’s profits, however, fell slightly due to lower oil and gas prices: net income during the quarter clocked in at $498 million, or $1.62 per share, compared with net income of $504 million, or $1.64 per share, in the third quarter of 2023. Hess’ ongoing trend of rapid output growth from Guyana continued in the third quarter. Guyana net production clocked in at 170,000 barrels of oil per day (bopd), up 57% from 108,000 bopd in the third quarter of 2023. However, Guyana's output fell sequentially from the second quarter’s 192,000 bpd (+75% Y/Y) due to planned downtime. Meanwhile, Bakken net production was 206,000 boepd, up 8% from 190,000 boepd in the third quarter of 2023. Overall net production for the quarter was 461,000 boepd, compared with 395,000 boepd in the third quarter of 2023, primarily due to higher production in Guyana. Hess expects fourth quarter E&P net production to be in the range of 475,000 boepd to 485,000 boepd, primarily reflecting recovery from downtime in the third quarter of 2024 at Guyana and Southeast Asia partially offset by planned maintenance at the Tubular Bells production facility in the fourth quarter of 2024. The company also issued updated 2024 full year guidance, with E&P capital and exploratory expenditures expected to be ~$4.9 billion, up from previous guidance of $4.2 billion, reflecting the decision to accelerate the purchase of the Liza Destiny and Prosperity floating production, storage and offloading vessels (FPSOs) to the fourth quarter of 2024 instead of in 2025. Back in May, Hess shareholderssigned off onits proposed $53B merger withChevron Corp.(NYSE:CVX) despite the deal being challenged by its leading Guyana partner,Exxon Mobil Corp.(NYSE:XOM). By Alex Kimani for Oilprice.com | Previous Post U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 13:13",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "revenue",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "price",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Governors-Demand-Power-Price-Overhaul-As-Costs-Balloon-10-Fold.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output The BRICS summit in Kazan… Julianne Geiger Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info Five U.S. governors have demanded PJM Interconnection, the largest power grid operator in the U.S., revise its pricing system after its recent capacity auction delivered a staggering increase in power plant costs—up nearly 10-fold from last year—but PJM says the green transition is to blame. The auction, meant to secure enough electricity supply for 65 million people across 13 states, sent shockwaves through the market as PJM revealed the steep price tag for meeting rising demand amid dwindling supply. Households and businesses in the region are now facing costs of $14.7 billion, sparking urgent calls from governors to address the runaway pricing before it bleeds consumers dry. PJM says it warned policymakers that the pivot from fossil fuels to green energy without bolstering renewable capacity would pinch the grid. But the governors argue that it’s on PJM to widen the pool of power suppliers and rethink price caps to avoid these massive surges. With data-hungry AI centers and extreme weather pushing demand through the roof, PJM’s latest auction outcome is just the beginning of what could be years of high prices and strained supply. Power company stocks are already enjoying theprice hikesas they plan for fatter profits, but the PJM region’s residents are left holding the bill. A move by PJM to delay the 2026/27 auction by six months may give it time to respond to the complaint. For now, PJM’s price hike is a wake-up call that more reliable power is essential—and expensive. The domino effect is already hitting Wall Street, with power company stocks getting a boost as utilities anticipate profits from high demand and power capacity constraints. PJM's move to delay its next auction might buy regulators time, but the message is clear: between AI, extreme weather, and retirements, the U.S. grid is playing a dangerous game of catch-up. And for the 65 million residents in PJM territory, that means digging deeper into their pockets for electricity. By Julianne Geiger for Oilprice.com | Previous Post Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion Next Post Hess Beats Q3 Earnings Estimates On Robust Guyana Output Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 12:10",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "price",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Russias-Gazprom-Boosts-2024-Investments-to-169-Billion.html",
        "content": "thanks to rising exports and domestic supply, the Russian gas giantsaidafter approving its new financial plan for the year. Previously, Gazprom was targeting investments of a total of $16.5 billion (1.574 trillion rubles) for 2024. The Russian company continues to develop key projects, including such aimed at boosting natural gas supply to China, Famil Sadygov, Deputy Chairman of the Management Committee at Gazprom, said in a statement carried by Russian news agency TASS. Gazprom still exports natural gas via pipelines to Europe, via a link crossing Ukraine, and through the TurkStream pipeline. The customers are several countries in central Europe. Russia has seen its gas exports to Europe significantly reduced since the invasion of Ukraine. The major drop in Gazprom’s gas deliveries was due to the halt of Russian pipeline gas exports to nearly all European countries. Weeks after the Russian invasion of Ukraine in early 2022, Russia cut off supply to Poland, Bulgaria, and Finland. Then Gazprom started to reduce supply via the Nord Stream pipeline to Germany in June 2022, claiming an inability to service gas turbine maintenance outside Russia due to the Western sanctions against Moscow for the invasion of Ukraine. This was weeks before the sabotage of the Nord Stream pipelines at the end of September 2022, which definitively closed all pipeline gas routes of Russia’s gas to Germany. Before the war in Ukraine, Russia supplied around one-third of all the gas to Europe. With most of European markets now closed, Russiaappears to be strugglingto convince China to take on more pipeline gas. Beijing is not committing to a massive new pipeline project to import Russian pipeline gas unless it’s favorable for the world’s second-largest economy. But Gazprom is pressing on andis acceleratingits natural gas exports to China through the existing Power of Siberia pipeline, aiming to hit maximum capacity by the end of 2024—a full year ahead of schedule. By Charles Kennedy for Oilprice.com | Previous Post Investment Giants Form $50-Billion AI and Power Partnership Next Post U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 10:44",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "economy",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "price",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Investment Giants Form $50-Billion AI and Power Partnership",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Investment-Giants-Form-50-Billion-AI-and-Power-Partnership.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Coal power provides the cheap… Charles Kennedy Charles is a writer for Oilprice.com More Info Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a$50 billionstrategic partnership to invest in data centers and power generation to support the growth of artificial intelligence (AI). Energy Capital Partners, the largest private owner of power generation and renewables in the United States, will collaborate with KKR to speed up the development of data center infrastructure and power generation and transmission infrastructure to back the rapid expansion of AI and cloud computing globally. The $50-billion bet from the two major investors highlights the momentum behind AI over the past two years. As a result of the advance in AI and the need for numerous data centers to support its development, power demand is expected to grow in the coming decade, including in the United States. Thanks to the partnership, KKR and ECP plan to engage with industry leaders including utilities, power and data center developers, and independent power producers to accelerate the delivery of data center campuses required by hyperscalers. “In order for the U.S. to maintain its advantage in AI, we will need massive new investments in power infrastructure on an accelerated basis that are capable of addressing concerns related to electricity prices and carbon emissions,” Doug Kimmelman, Founder and Senior Partner, ECP, said in a statement. “We are committed to delivering solutions for our strategic partners and our investors through ECP’s strong utility relationships and expertise investing across a wide variety of power generation, renewable, and battery storage assets.” Commenting on the AI and data center boom, Kimmelman toldThe Wall Street Journal, “The capital needs are huge, and one of the big bottlenecks—maybe the bottleneck—is electricity availability.” ECP believes that natural gas power plants could support much of the needed new generation capacity. U.S. power-generating companiesare announcing plansfor the highest volume of new natural gas-fired capacity in years as the AI boom is driving demand for electricity. By Charles Kennedy for Oilprice.com | Previous Post Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE Next Post Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 09:20",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Vietnamese-EV-Maker-Gets-1-Billion-in-Funding-Led-by-UAE.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Oil companies have historically underperformed,… Charles Kennedy Charles is a writer for Oilprice.com More Info Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s leading driver training and road safety institute, Bloombergreportedon Wednesday, quoting a source with knowledge of the agreement. VinFast and its parent company, Vingroup, earlier this weeksigned strategic partnershipswith companies in the Middle East during an official visit of Vietnamese Prime Minister Pham Minh Chinh to the United Arab Emirates (UAE). The memoranda of understanding (MOUs) cover strategic areas, including maritime development and shipyard building capabilities, sustainable coastal land utilization, digital transformation, and collaboration in electric vehicles and green transportation, VinFast said. Under the deal between VinFast and Emirates Driving Company, EDC will lead a consortium investing in VinFast. In addition to gaining access to funding, VinFast will benefit from EDC’s expertise in driver training and road safety, supporting the development of a comprehensive EV ecosystem, the Vietnamese automaker said. “This partnership aims to enhance global electric vehicle production, meet the growing demand for green transportation, increase road safety awareness, and reaffirm EDC’s commitment to contributing to the Middle East’s green transportation revolution, addressing environmental and climate challenges,” VinFast added. Also this week, VinFast Autoofficially launchedin the Middle Eastern market as part of the company’s international expansion strategy. While working on expanding EV manufacturing, Vietnam seeks closer cooperation with the Middle East in fuel supply and distribution. Saudi oil giant Aramco is seeking to invest in oil refining and fuel distribution in the Southeast Asian country, where economic growth has exceeded the global average in recent years. “Vietnam has great potential in the region, therefore, Aramco wishes to invest in oil refinery and petrol distribution in the country,” the government of Vietnamsaidin a statement carried by Reuters. On Wednesday, Aramcosigneda collaboration framework agreement with Vietnam Oil and Gas Group (Petrovietnam) to explore opportunities for cooperation in storage and the supply and trading of energy and petrochemical products. By Charles Kennedy for Oilprice.com | Previous Post The West Needs Incentives to Cut Russian Nuclear Fuel Dependence Next Post Investment Giants Form $50-Billion AI and Power Partnership Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 08:55",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/The-West-Needs-Incentives-to-Cut-Russian-Nuclear-Fuel-Dependence.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Several months after the Act’s… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French company Orano, one of the top Western suppliers of enriched uranium. “To entirely disconnect from Russia, we need new capacities, and industrial groups will only invest if they have long-term contracts,” Orano’s CEO Nicolas Maes told theFinancial Timesin an interview published on Wednesday. France’s Orano and Urenco, a consortium created in 1970 by the governments of Germany, the Netherlands, and the UK, are the main Western competitors of Russia’s state-owned nuclear energy firm Rosatom. Europe has not sanctioned Rosatom or Russian nuclear fuel supplies as dozens of nuclear power stations in the eastern EU member states have been built by Russian companies and supplied with Russian nuclear fuel. A compromise sanctions measure hasn’t been agreed. As many countries are now looking to nuclear power to cut emissions and reliance on imports of oil and gas, they would need to cut their dependence on enriched uranium from Russia. But in order to reduce reliance on Russia, western contractors and suppliers would need visibility over the long-term demand, the chief executive of France’s Orano told FT. The executive also called for sanctions on the Russian nuclear sector, saying that “If there are no sanctions at all, we’ll see some electricity producers continue to get supplies from Russia as long as it’s possible.” Orano has started working with designers for small modular reactors (SMRs) and advanced modular reactors (AMRs), the companysaidearlier this month. “With the creation of two “sharing groups”, Orano is acting as a strategic partner for start-ups working on the development of AMRs,” said the French company. France, where nuclear power dominates electricity generation, has been looking to build SMRs and other types of next-generation reactors. By Tsvetana Paraskova for Oilprice.com | Previous Post Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million Next Post Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 08:03",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Gazprom-Unit-Sues-Industrial-Gases-Giant-Linde-for-884-Million.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output According to Saudi Arabia’s National… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim over Linde’s withdrawal from a gas processing plant in east Russia. The subsidiary of Gazprom, which operates the new Amur Gas Processing Plant, has filed the claim at the Arbitration Court of the Amur Region in Russia, Reutersreportedon Wednesday, citing court documents it had seen. Following the Russian invasion of Ukraine, Germany-based Linde said in 2022 that it would withdraw from Russia, suspend all developments, sell industrial assets, and terminate supply to certain customers. In June 2022, Lindeendedits participation in the Amur gas processing complex, which is part of the Russian network of natural gas exports via the Power of Siberia pipeline to China. Two years earlier, Lindehad won a contractto provide engineering, procurement, and site services based on its proprietary technology for the cracker unit of SIBUR's Amur Gas Chemical Complex. Companies in Russia have filed several claims against Linde since the Western firm announced its withdrawal from the country two years ago. Most recently, a Russian court in Augustorderedthat assets worth $1.15 billion of a Linde subsidiary in the UK be frozen, as part of a dispute over another gas processing plant, the Ust-Luga complex. Linde signed in 2021 an engineering, procurement and construction (EPC) contract with Gazprom for the complex. Gazprom is involved in many other lawsuits and claims over previous contracts for supply of services or goods. In June, an arbitration tribunal awarded German energy giant Uniper theright to terminateits long-term Russian gas supply contracts and awarded it more than $14.1 billion (13 billion euros) in damages for the gas volumes that Gazprom Export has not supplied since the middle of 2022. By Tsvetana Paraskova for Oilprice.com | Previous Post Chinese Oil Major to Explore Iraqi Field Next Post The West Needs Incentives to Cut Russian Nuclear Fuel Dependence Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 07:33",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Chinese Oil Major to Explore Iraqi Field",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Chinese-Oil-Major-to-Explore-Iraqi-Field.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Uncertainty surrounds OPEC+ production plans… Charles Kennedy Charles is a writer for Oilprice.com More Info China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be managed by a fully owned subsidiary of the Chinese company, CNOOC Africa Holding, with the first phase of the work planned to take three years, Reutersreported. The dealfollowsCNOOC’s winning bid for Block 7 following a tender that the Iraqi government carried out earlier this year, where Chinese energy majors were the big winners, winning a total of four bids for nine oil and gas deposits. Chinese companies’ entry into Iraq’s oil and gas sector is a result of an agreement inked back in 2019 and dubbed “Oil for Reconstruction and Investment”, under which Chinese companies are granted entry into Iraq’s energy infrastructure sector as investors in return for oil supplies. In addition to this agreement, Iraq’s government sought to stimulate more foreign investment in its oil and gas resources by changing the mechanism used to share profits from exploration and production activities. Previously, Iraq offered foreign energy investors a technical service contract, which paid a flat fixed rate to the producing companie for every barrel they extracted. This was considered sub-optimal by the producers since it meant that they could not make more money when oil prices went higher and at the same time had to shoulder any upward changes in production costs. Since this led to a pullout by some supermajors, Iraq decided to offer those still in the country and potential new entrants a profit-sharing agreement mechanism that did not feature the above problems with costs and market price advantages. It was this change in contract terms that convinced TotalEnergies to sign a massive $27-billion deal with the Iraqi authorities for the development of the country’s natural gas reserves, as well as solar power capacity. By Charles Kennedy for Oilprice.com | Previous Post Oil Prices Remain Subdued on the Prospect of an Israel-Lebanon Ceasefire Next Post Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 06:09",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "barrel",
                3
            ],
            [
                "price",
                3
            ]
        ]
    },
    {
        "headline": "Oil Prices Remain Subdued on the Prospect of an Israel-Lebanon Ceasefire",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Remain-Subdued-on-Prospect-of-Israel-Lebanon-Ceasefire.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Rolls-Royce sells a minority stake… Irina Slav Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry. More Info Crude oil prices remained subdued after falling to the lowest in a month earlier in the week, as Israel indicated it was ready to negotiate an end to the hostilities with Lebanon. At the time of writing,Brent crudewas trading at $71.76 per barrel, andWest Texas Intermediatewas changing hands at $67.91 per barrel, both slightly up from opening in Asian trade. “A hefty plunge in oil prices since the start of the week may call for an attempt to stabilise in today’s session, but overall gains remain limited, given the lack of bullish catalysts to drive a more sustained up-move,” IG market strategist Yeap Jun RongtoldReuters, adding that the prospect of a ceasefire reduces the risk of further escalation in the oil region, diminishing concern about a supply disruption. However, Standard Chartered warned that the easing of that concern may be premature. “We see the risk of an escalating series of attacks over an extended period, with no immediate prospect of either military or diplomatic resolution,” analysts with the bank wrote in a report, ascitedby Bloomberg. “There has been a trend over the past year for the market to act as if every escalation in Middle East geopolitical risk is a de-escalation,” they wrote, pointing out that Israel had still not achieved all its goals with regard to Iran, leaving a door open to further regional violence that could affect prices, especially in the months leading up to the inauguration of the next U.S. president. In further potentially bullish news for oil, China is set to unveil yet another fiscal stimulus package next week. However, Reutersnotedin a report on the news, that additional stimulus would likely act more as a stabilizer of the economy rather than a booster, limiting its potential positive impact on crude oil demand. By Irina Slav for Oilprice.com | Previous Post Ukraine and Russia Discuss Halting Attacks on Energy Sites Next Post Chinese Oil Major to Explore Iraqi Field Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: Sign up to receive our exclusive free report:The Fundamentals ofOil and Gas Company Evaluation",
        "date": "Oct 30, 2024 at 04:55",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "economy",
                4
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Ukraine-and-Russia-Discuss-Halting-Attacks-on-Energy-Sites.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Israel's military actions in Gaza… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Timesreports, citing sources with knowledge of the matter. Over the past year, Russiahas attackedUkrainian energy facilities, targeting power plants. Ukraine, for its part, has been targeting oil depots, terminals, and refineries. Previous talks on a potential halt to these attacks from both sides were close to reaching an agreement in August this year. But the negotiations were derailed by the surprise Ukrainian groundincursioninto the Kursk region in Russia in early August, according to FT’s sources. Very early-stage talks have reportedly resumed now, and “There’s now talks on the energy facilities,” a diplomat told FT. Last week, Ukrainian President Volodymyr Zelenskyysaidthat the two sides need to agree to halt attacks on crucial civilian energy and food infrastructure, as a step toward potential de-escalation of the most aggressive phase of the war so far. Attacks on energy infrastructure have been dialed down from both sides in recent weeks, as part of an understanding between the Ukrainian and Russian intelligence agencies, a senior Ukrainian official told FT. Refineries and oil depots in Russia, especially those in the southwest, have seen extensive maintenance and halts due to attacks from Ukrainian drones this year. Scheduled maintenance is alsoboosting the idle refining capacityin Russia this month. Russia has raised the refining capacity volumes it expects to be idle this month by 67% compared to an earlier plan, due to scheduled maintenance at major refineries, Reuters estimatesshowedearlier this month. Ukrainian attacks on Russian oil refineries and other energy infrastructure have become a fixture this year, with drones the weapon of choice for conducting the strikes. Russia, for its part, has been targeting power plants, which has crippled Ukrainian electricity supply. By Tsvetana Paraskova for Oilprice.com | Previous Post Lukoil’s Trading Arm Looks to Revive U.S. Business Next Post Oil Prices Remain Subdued on the Prospect of an Israel-Lebanon Ceasefire Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 04:05",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Lukoils-Trading-Arm-Looks-to-Revive-US-Business.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output According to Saudi Arabia’s National… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging credit lines and distancing itself from Russian oil trades and its parent, sources close to Litasco have toldReuters. Litasco and Lukoil have not been sanctioned by the United States as part of the wide-ranging sanctions on Russian energy companies. The U.S. and its Western allies are looking to stifle Vladimir Putin’s revenues from energy exports—Moscow’s single most important source of income for the budget. Despite the fact that neitherSwitzerland-based Litasco, nor Lukoil are on a sanctions list, international credit lines to the trading firm have dried up to near zero, according to Reuters’s sources. Banks, insurers, and other stakeholders in the oil trading business have been avoiding doing deals with Litasco anyway, for fear of future sanctions on the company or Lukoil, and for concerns about image as many players have sought to distance themselves from trading in Russian oil and petroleum products. Litasco is now looking to distance itself from its Russian parent Lukoil, the second-biggest oil producer in Russia after state-controlled Rosneft, one source told Reuters. Others added that Litasco operates independently of its parent company. Litasco is now looking to rebuild its oil and fuel trading business in North, Central, South Americas and the Caribbean, one of the sources said. All three sources told Reuters that Litasco’s U.S.-based unit, Lukoil Pan Americas, does not trade in oil cargoes of Russian origin. Apart from distancing itself from dealing in Russian oil, Litasco has already secured over $2 billion in open credit lines which will support its trades, according to the sources. These credit lines put “the company in a solid financial position to re-activate the business which was virtually dormant for the past two years,” one source told Reuters. By Tsvetana Paraskova for Oilprice.com | Previous Post Unexpected Crude, Product Draws Send Oil Prices Up Next Post Ukraine and Russia Discuss Halting Attacks on Energy Sites Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 03:08",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "investment",
                3
            ]
        ]
    },
    {
        "headline": "Unexpected Crude, Product Draws Send Oil Prices Up",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Unexpected-Crude-Product-Draws-Send-Oil-Prices-Up.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output While Middle East tensions have… Julianne Geiger Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info Crude oil inventories in the United fell by 573,000 barrels for the week ending October 25, according to The American Petroleum Institute (API). Analysts had expected a build of 2.3 million barrels. For the week prior, the API reported a 1.643-million-barrel build in crude inventories. So far this year, crude oil inventories have slumped by just over 6 million barrels since the beginning of the year, according to API data. On Tuesday, the Department of Energy (DoE) reported that crude oil inventories in the Strategic Petroleum Reserve (SPR) rose by 1.2 million barrels as of October 25. SPR inventories are now at 385.8 million barrels, a figure that reflects an increase of about 38 million from its multi-decade low last summer, yet 249 million down from when President Biden took office. At 4:30 pm ET,Brent crudewas trading down slightly, off $0.16 (-0.22%) on the day at $71.26—down roughly $4.50 per barrel loss from this time last week. The U.S. benchmark WTI was also trading down on the day by $0.08 (-0.12%) at $67.30—down almost $5 per barrel from last Tuesday. Gasoline inventories fell this week by 282,000 barrels, on top of last week’s 2.019-million-barrel decrease. As of last week, gasoline inventories are 3% below the five-year average for this time of year, according to the latestEIA data. Distillate inventories fell by 1.463 million barrels, on top of last week’s 1.478-million-barrel decrease. Distillates were already about 9% below the five-year average as of the week ending October 18, the latest EIA data shows. Cushing inventories—the benchmark crude stored and traded at the key delivery point for U.S. futures contracts in Cushing, Oklahoma—rose by 320,000 barrels, according to API data, compared to the 216,000-barrel draw of the previous week. By Julianne Geiger for Oilprice.com | Previous Post U.S. To Buy 3 Million Barrels for The SPR, But There’s A Problem Next Post Lukoil’s Trading Arm Looks to Revive U.S. Business Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: Sign up to receive our exclusive free report:The Fundamentals ofOil and Gas Company Evaluation",
        "date": "Oct 29, 2024 at 15:51",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "loss",
                2
            ]
        ]
    },
    {
        "headline": "U.S. To Buy 3 Million Barrels for The SPR, But There’s A Problem",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/US-To-Buy-3-Million-Barrels-for-The-SPR-But-Theres-A-Problem.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output India and China have reached… Alex Kimani Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info The U.S. Department of Energy (DoE) is seeking to purchase 3 million barrels of crude oil for the Strategic Petroleum Reserve (SPR), the latest in a string of contracts aimed at refilling emergency inventories following arecord releaseof 180 million barrels in 2022. The DoE has since repurchased over 56 million barrels at an average price of around $76/barrel, considerably lower than its sale price of $95/barrel. The DoE has also worked with Congress to cancel a previously planned sale of 140 million barrels of oil from the reserve, also counting toward the refilling of the stockpile. However, this might be the last big purchase by the Biden administration, or even the next administration, with the funds allocated by Congress almost depleted. Whereas it remains unclear exactly how much money the DoE has left in its fund to buy more oil, a department source said earlier in the month that it had only $150 million left, or about enough to buy a little over 2 million barrels atcurrent oil prices. The SPR had ~384.6 million barrels of crude oil as of October 18, the highest level since the end of 2022 but still well below the typical 600-700 million the SPR held when the country used to rely more heavily on oil imports. The DoE has repeatedly reassured observers that it will continue with the exercise. ‘‘The DOE will continue to purchase crude at a good price for taxpayers with available emergency revenues,\" a department spokesperson said on Monday. Not everyone is convinced it’s going to be a walk in the park going forward. \"Imminent depletion of the SPR petroleum account puts the onus on Capitol Hill for further replenishment, but politicization of the SPR could make it hard for lawmakers to agree,\" Kevin Book, a policy analyst at ClearView Energy Partners, a non-partisan research group, told Reuters. According to his estimates, \"theoretically\" there would still be some money left if the latest solicitation was fulfilled, but that it would not be much. By Alex Kimani for Oilprice.com | Previous Post As Oil Job Losses Mount, Steelworkers Union Looks to Clean Energy Next Post Unexpected Crude, Product Draws Send Oil Prices Up Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: Sign up to receive our exclusive free report:The Fundamentals ofOil and Gas Company Evaluation",
        "date": "Oct 29, 2024 at 13:56",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "price",
                3
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ]
        ]
    },
    {
        "headline": "As Oil Job Losses Mount, Steelworkers Union Looks to Clean Energy",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/As-Oil-Job-Losses-Mount-Steelworkers-Union-Looks-to-Clean-Energy.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Egypt, a major energy player… Alex Kimani Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info The United Steelworkers union is counting on renewable energy projects to offset job losses at oil refining and petrochemical plants, a union official hastold Reuters, adding that some 17,000 new union jobs could be replaced thanks to the 2022 Inflation Reduction Act (IRA). The USW–which represents some 30,000 workers from North American crude oil refinery and petrochemical plants–appears to remain optimistic even in the event of a victory for Donald Trump in next week’s elections. Trump has promised to reverse the IRA if he wins. \"The Inflation Reduction Act was a bipartisan bill,\" USW District 13 director Larry Burchfield told Reuters. \"There's a lot all sewed up in the IRA. It would take a lot to undo it.\" Nevertheless, other experts have warned that Trump could still significantly change America’s energy trajectory during a second term. Energy analytics firm Wood Mackenziehas predictedthat a second Trump presidency could place a huge part of renewable energy investments at risk, increase carbon emissions by 1 billion tonnes more by 2050 and delay peak fossil fuel demand by 10 years beyond current forecasts. WoodMac projects ~$7.7T in overall spending by the U.S. energy sector through 2050 under current policies, a figure that could be cut by $1T under Trump through reduced policy support for low carbon energy and infrastructure improvements. The analysts have predicted that less spending on low carbon energy could boost demand for natural gas by 6% or 6B cf/day by 2030. WoodMac says that whereas Trump would lack the power to unilaterally repeal the Inflation Reduction Act (IRA) enacted during the Biden presidency, he could bring changes to environmental rules and executive orders that would roll back many of Biden's environmental policies. The research firm also projects that the total number of EVs on U.S. roads in 2050 would be 50% lower than under current policies because automakers would likely favor the production of hybrid vehicles over pure electric cars. There’s a lot at stake here. The auto industry has unveiled more than $100 billion in EV investments, with potential to create 100,000 American jobs.By Alex Kimani for Oilprice.com | Previous Post TotalEnergies to Produce More Gas Condensate Offshore Denmark Next Post U.S. To Buy 3 Million Barrels for The SPR, But There’s A Problem Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 29, 2024 at 13:05",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/TotalEnergies-to-Produce-More-Gas-Condensate-Offshore-Denmark.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Armenia and Azerbaijan are nearing… Charles Kennedy Charles is a writer for Oilprice.com More Info U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as expected, due to weak refining margins and fuel demand. Phillips 66reportedon Tuesday adjusted earnings of $859 million, or $2.04 per share, for the third quarter, down from $2.1 billion, or $4.63 EPS, for the same period last year. Despite the profit slump, the company’s adjusted EPS topped the analyst consensusestimate of $1.65compiled by The Wall Street Journal. During the third quarter of 2024, the midstream business of Phillips 66 held steady compared to the second quarter and the same period last year, but the refining division posted a loss of $108 million, compared to massive refining earnings of $1.7 billion for the third quarter of 2023, when refining margins were soaring. This year, however, weaker demand for fuels and slumping refining margins have been weighing on refiners and the integrated oil and gas majors. Phillips 66 said that the adjusted refining pre-tax loss was “primarily due to a decline in realized margins largely driven by lower market crack spreads.” The 3-2-1 crack spread – which is a theoretical refinery crude yield to produce two barrels of gasoline and one barrel of diesel for every three barrels of crude input – slumped in the U.S. last month to $14.28 per barrel, the lowest level since the beginning of 2021. All U.S. refiners areexpected to reportmuch lower profits for the third quarter compared to a year earlier, as refining margins slumped to multi-year lows amid tepid fuel demand and increased global fuel supply. Yet, apart from Phillips 66, another major U.S. refiner, Valero Energy (NYSE: VLO), alsobeat Wall Street estimateseven as it reported last week a widely expected plunge in its third-quarter earnings due to slumping refining margins. By Charles Kennedy for Oilprice.com | Previous Post Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3 Next Post As Oil Job Losses Mount, Steelworkers Union Looks to Clean Energy Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: Sign up to receive our exclusive free report:The Fundamentals ofOil and Gas Company Evaluation",
        "date": "Oct 29, 2024 at 10:59",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "loss",
                2
            ],
            [
                "supply",
                2
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Phillips-66-Beats-Analyst-Estimates-Despite-Earnings-Dip-in-Q3.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output BP and Shell anticipate lower… Charles Kennedy Charles is a writer for Oilprice.com More Info U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as expected, due to weak refining margins and fuel demand. Phillips 66reportedon Tuesday adjusted earnings of $859 million, or $2.04 per share, for the third quarter, down from $2.1 billion, or $4.63 EPS, for the same period last year. Despite the profit slump, the company’s adjusted EPS topped the analyst consensusestimate of $1.65compiled by The Wall Street Journal. During the third quarter of 2024, the midstream business of Phillips 66 held steady compared to the second quarter and the same period last year, but the refining division posted a loss of $108 million, compared to massive refining earnings of $1.7 billion for the third quarter of 2023, when refining margins were soaring. This year, however, weaker demand for fuels and slumping refining margins have been weighing on refiners and the integrated oil and gas majors. Phillips 66 said that the adjusted refining pre-tax loss was “primarily due to a decline in realized margins largely driven by lower market crack spreads.” The 3-2-1 crack spread – which is a theoretical refinery crude yield to produce two barrels of gasoline and one barrel of diesel for every three barrels of crude input – slumped in the U.S. last month to $14.28 per barrel, the lowest level since the beginning of 2021. All U.S. refiners areexpected to reportmuch lower profits for the third quarter compared to a year earlier, as refining margins slumped to multi-year lows amid tepid fuel demand and increased global fuel supply. Yet, apart from Phillips 66, another major U.S. refiner, Valero Energy (NYSE: VLO), alsobeat Wall Street estimateseven as it reported last week a widely expected plunge in its third-quarter earnings due to slumping refining margins. By Charles Kennedy for Oilprice.com | Previous Post UK Offshore Oil Platform Halted Due to Gas Compressor Issue Next Post TotalEnergies to Produce More Gas Condensate Offshore Denmark Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: Sign up to receive our exclusive free report:The Fundamentals ofOil and Gas Company Evaluation",
        "date": "Oct 29, 2024 at 09:52",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "loss",
                2
            ],
            [
                "supply",
                2
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/UK-Offshore-Oil-Platform-Halted-Due-to-Gas-Compressor-Issue.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Uncertainty surrounds OPEC+ production plans… Charles Kennedy Charles is a writer for Oilprice.com More Info Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the single gas compressor in operation, one of the project partners, Serica Energy,saidon Tuesday. A potential dry gas seal failure was identified in the ‘A’ gas compressor during operations on October 26, 2024, Serica said today, adding that no oil and gas has been leaked from the platform. The FPSO operator, Dana Petroleum, is working to identify and execute the necessary repair, according to Serica. In June, Sericasaidthat the Triton FPSO is currently operating with a single gas export compressor with repairs to restore two compressor operations due in October. With the production halt at Triton now, Serica said that its ability to maintain full-year production guidance of towards the bottom of the 41,000 boepd to 46,000 boepd range was dependent on sustained production levels of around 50,000 boepd in the fourth quarter. Given the outage of production from Triton, Serica’s production for 2024 is now expected to be slightly below this previous guidance, the company said. The Triton Area consists ofeight producing oil fieldsdeveloped via common infrastructure in the UK Central North Sea, located approximately 190 km (118 miles) east of Aberdeen. The fields currently producing oil and gas via the Triton FPSO vessel are Evelyn, Bittern, Guillemot West and Guillemot Northwest, Gannet E, Clapham, Pict, and Saxon. Serica Energy’s partners in the cluster are Dana Petroleum Limited and Waldorf Production UK Limited. Dana currently operates the Triton FPSO along with the Bittern, Guillemot West / North West, Clapham, Saxon, and Pict fields. Serica is the operator of the Gannet E and Evelyn fields, with Dana as the pipeline operator and Petrofac as the well operator. Serica also operates the Belinda field. Earlier this year, Serica said it hadreceived final approvalfrom the UK regulator, the North Sea Transition Authority (NSTA), to develop the 100% owned and operated Belinda field. By Charles Kennedy for Oilprice.com | Previous Post Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery Next Post Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3 Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 29, 2024 at 09:12",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Nigeria-Discusses-Crude-and-Fuel-Supply-with-Africas-Top-Refinery.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output Tesla's Q3 earnings report reveals… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply to Nigeria with Nigeria’s President Bola Tinubu at an emergency meeting on Tuesday. Dangote and President Tinubu are meeting with representatives of the domestic oil industry regulators and oil industry officials as the new refinery of the Dangote Group has faced issues with crude supply since it started up operations earlier this year. The Dangote refinery began the production of fuels in January 2024,marking the start-upof the plant that has seen years of delays. The refinery, which has a processing capacity of650,000 barrels per day(bpd), will meet 100% of Nigeria’s demand for all refined petroleum products and will also have a surplus of each of the products for export. It has yet to reach full capacity, expected at some point next year. However, the crude supply to the refinery has been an issue for Dangote in recent months. “We’re meeting to make sure everything is put together. There are a lot of issues about the exchange rate and pricing,” Dangote told theFinancial Times. There have been reports and speculation that Dangote has fallen out with the Nigerian president, who is reportedly not as supportive of Dangote’s business as his predecessor. Moreover, rumors have it that Africa’s wealthiest person has issues with the state oil firm NNPC. Dangote told FT that there his relationship with the president hasn’t been strained and insisted they are on good terms. Earlier this month, the Dangote refinery received four cargoes from NNPC under a sale agreement to deliver crude which the refinery will pay in naira, the local currency, Nigerian mediareported. Dangote wants to end Nigeria’s fuel imports with the mega refinery. So far, the biggest oil producer in Africa has been importing all of the fuel it consumes. But the businessman told FT that an “oil mafia” exporting crude and importing cheap – including Russian – crude is trying to undermine these plans. By Tsvetana Paraskova for Oilprice.com | Previous Post Austria’s OMV Profit Slumps on Weak Oil Trading and Refining Next Post UK Offshore Oil Platform Halted Due to Gas Compressor Issue Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 29, 2024 at 07:56",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Austrias-OMV-Profit-Slumps-on-Weak-Oil-Trading-and-Refining.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output India and China have reached… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil prices, refining margins, and trading. OMV on Tuesdaysaidthat its net profit on a current cost of supply (CCS) basis, its closest metric to net income, fell by 20% to $374 million (346 million euros) for the third quarter, lower than a company-provided consensus of $495 million (457 million euros). Operating profit adjusted for the current cost of supply fell by 21% year-over-year to $1.13 billion (1.05 billion euros). Higher results in the chemicals division, with better margins for polyolefins and olefins, were unable to offset much lower refining earnings amid plunging margins. Moreover, OMV’s oil and gas production fell by 9% to 332,000 barrels of oil equivalent per day (boepd), while production cost rose by 18% to $10.6 per barrel of oil equivalent. The company’s average realized oil and natural gas sales dropped as prices for crude oil and natural gas were lower in the third quarter compared to the same period of 2023. OMV’s earnings in the Fuels & Feedstock division slumped between July and September, due to significantly reduced refining indicator margins, partly compensated by strong retail performance. The OMV refining indicator margin in Europe plunged by 64% to $5 per barrel. “A stable utilization rate at the European refineries and an improved retail result had a partially offsetting effect,” OMV said. The positive contribution of the retail business was driven by improved margins as well as higher volumes, partly due to the acquisition of additional filling stations in Austria and Slovakia. Lower refining and trading margins also led to lower contributions from ADNOC Refining and ADNOC Global Trading, OMV’s joint venture business with Abu Dhabi’s national oil company ADNOC and Italian energy major Eni. By Tsvetana Paraskova for Oilprice.com | Previous Post BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining Next Post Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 29, 2024 at 07:06",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/BP-Earnings-Top-Forecasts-Despite-Weaker-Oil-Prices-and-Refining.html",
        "content": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output This article explores the potential… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil prices and low refining margins. BPreportedon Tuesday an underlying replacement cost (RC) profit – its key earnings metric closest to net profit – of $2.3 billion for the third quarter, down by 30% compared to the same period of 2023 and down from $2.8 billion for the previous quarter. While the third-quarter profit was BP’s weakest since the fourth quarter of 2020, it beat the analyst consensus of $2.1 billion compiled by LSEG. Compared with the second quarter of 2024, the earnings reflect “weaker realized refining margins, a weak oil trading result and lower liquids realizations, partly offset by higher gas realizations,” BP said in a statement, adding that the gas marketing and trading result was “average”. Earlier this month, BP had alreadyflagged weaker earningsfor Q3, on the back of weak refining margins and weaker oil trading results. Falling refining margins have already hit the second-quarter earnings of the supermajors, and further declines in Q3 are expected to continue to weigh on the profits. Shell, which reports Q3 results on Thursday, has also warned that lower refining margins and a loss in its chemicals business wouldweighon its third-quarter earnings. At BP, net debt rose to $24.3 billion, up from $22.6 billion at the end of the second quarter, primarily driven by lower operating cash flow, higher capital expenditures, and lower divestment and other proceeds, the UK-based supermajor said. Despite the lower earnings and higher debt, BP announced a $1.75 billion share buyback as part of its $3.5 billion commitment for the second half of 2024. Furthermore, BP is committed to announcing $1.75 billion for the fourth quarter of 2024, it said. However, the company intends to review elements of its financial guidance, including expectations for 2025 share buybacks, in a February update on its medium-term plans. These could include BPscrapping a previous targetto reduce its oil and gas production by the end of the decade. In today’s results release, CEO Murray Auchincloss said “In oil and gas, we see the potential to grow through the decade with a focus on value over volume.” “We also have a deep belief in the opportunity afforded by the energy transition,” Auchincloss added. By Tsvetana Paraskova for Oilprice.com | Previous Post China Plans to Export 12.4% Less Fuel in November Next Post Austria’s OMV Profit Slumps on Weak Oil Trading and Refining Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: Sign up to receive our exclusive free report:The Fundamentals ofOil and Gas Company Evaluation",
        "date": "Oct 29, 2024 at 06:03",
        "author": "Unknown Author",
        "author_bio": "",
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "loss",
                2
            ]
        ]
    }
]