[
    {
        "headline": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Rebound-But-Henry-Hub-Nat-Gas-Still-Taking-a-Beating.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Leaked documents from U.S. intelligence… Alex Kimani Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info U.S oil and gas prices have taken divergent trajectories, with oil prices rebounding while natural gas prices have continued to fall in Thursday’s session. Oil and gas prices crashed on Monday, with benchmark crude oil futures falling to their biggest one-day decline in more than two years after Israel launched limited attacks on Iran that disappointed markets, followed by Tehran stating it would not retaliate with a direct response. However, oil prices have pared back some of the losses with nearly a percentage point in gains.Brent crudefor December delivery was trading at $73.17 per barrel at 12.32 am ET, up from their 2-month low of $70.97 on Tuesday while WTI crude for December delivery was up 0.85% on the day to trade at $69.19 per barrel. Commodity analysts at Standard Chartered havepointed outthat oil markets are overlooking the vulnerability of Iran’s energy infrastructure to future attacks. Three days ago, the Guardian reported that Israel used precision air and drone strikes to principally target air defense systems protecting crucial oil and gas facilities, as well as military sites linked to Tehran’s nuclear programme and ballistic missile production. Meanwhile,natural gas futureshave dropped below $2.8/MMBtu as supply concerns eased, after losing 11% earlier in the week, and down another 4.15% at the time of writing. Meteorologists have forecast warmer-than-normal temperatures across the Lower 48 states through at least November 9, giving utilities an opportunity to inject more gas into storage than usual for this time of year. Further, LNG feedgas supply is expected to stay below record levels for the next few weeks due to maintenance at various facilities includingCheniere Energy(NYSE:LNG) and Cameron LNG. U.S. gas production from the lower 48 states averaged 102.8 Bcf/d over the weekend, close to 103 Bcf/d summer high and up about 2 Bcf/d from autumn lows. In its October short-term energy outlook (STEO), the EIA forecast Henry Hub spot prices would average $3.06/MMBtu in 2025. On a quarterly basis, the EIA predicted in the October STEO that Q4 2024 Henry Hub spots prices would average $2.81/MMBtu, and $3.16/MMBtu in Q1 2025, dipping lower in Q2 and then up to $3.35/MMBtu in Q4. By Alex Kimani for Oilprice.com | Previous Post Record Shale Production Helps ConocoPhillips Beat Profit Estimates Next Post Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 11:41",
        "author": "Alex Kimani",
        "author_bio": "Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com.",
        "contributor_since": "28 Jan 2019",
        "other_articles": [
            {
                "heading": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating",
                "excerpt": "U.S oil and gas prices have taken divergent trajectories, with oil prices rebounding while natural gas prices have continued to fall in Thursday’s session. Oil…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Iran’s Energy Infrastructure More Vulnerable To Future Attacks",
                "excerpt": "Two days ago, benchmark crude oil futures fell by their largest one-day margin in more than two years after Israel launched limited retaliatory attacks on…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output",
                "excerpt": "Leading U.S. shale operator, Hess Corp. (NYSE:HES), has posted yet another impressive earnings report, with its stake in prolific Guyana helping it exceed estimates. Hess…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "China’s Oil and Steel Industries Are in the Red. What Now?",
                "excerpt": "China has seen very mixed fortunes from its commodities markets, which have been languishing under a long-running crisis in the property sector, according to The…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "U.S. To Buy 3 Million Barrels for The SPR, But There’s A Problem",
                "excerpt": "The U.S. Department of Energy (DoE) is seeking to purchase 3 million barrels of crude oil for the Strategic Petroleum Reserve (SPR), the latest in…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "As Oil Job Losses Mount, Steelworkers Union Looks to Clean Energy",
                "excerpt": "The United Steelworkers union is counting on renewable energy projects to offset job losses at oil refining and petrochemical plants, a union official has told…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "The Biden Administration Just Approved Its First Lithium Mine",
                "excerpt": "Last week, the Rhyolite Ridge Lithium-Boron Project in Nevada became the first-ever lithium mine to receive the green light from the Biden administration. Shares of…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oil Continues Downward Slide Shedding Over 6%",
                "excerpt": "Oil markets have continued the downward spiral, with oil prices falling dramatically after Israel launched limited attacks on Iran. Supreme Leader Ayatollah Ali Khamenei helped…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Natural Gas Prices Plummet 11% as Israel-Iran Conflict Cools",
                "excerpt": "U.S. natural gas prices crashed on Monday after Israel launched limited attacks on Iran while Supreme Leader Ayatollah Ali Khamenei helped cool tensions after he…",
                "keywords": [
                    "gas"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "USGS Finds Enough Lithium to Meet Annual Demand Nine Times Over",
                "excerpt": "The United States Geological Survey (USGS) and the Arkansas Department of Energy and Environment's Office of the State Geologist have discovered a vast lithium reserve…",
                "keywords": [
                    "energy"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "U.S. Allies Unite for Critical Minerals Marketplace",
                "excerpt": "Earlier in the week, Reuters reported that the European Union has kicked off the process of choosing between eight bidders to create a 9-million-euro joint…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Mckinsey: Europe's Data Center Power Demand To Triple By 2030",
                "excerpt": "Europe's data center power consumption is expected to almost triple by 2030 and will require a surge in electricity—supply mostly from low-carbon sources coupled with…",
                "keywords": [
                    "supply"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Standard Chartered: Global Oil Demand Hit An All-Time High In August",
                "excerpt": "Momentum in oil markets has continued to skew towards the downside over the past two weeks, with the last 10 trading days seeing front-month Brent…",
                "keywords": [
                    "oil"
                ],
                "published_date": "23 October 2024"
            },
            {
                "heading": "Harbour Energy Joins North Sea Oil Exodus Ahead Of Tax Hikes",
                "excerpt": "Top British North Sea producer Harbour Energy (OTCPK:PMOIF) has revealed plans to sell stakes in North Sea oilfields and has revived plans for a U.S.…",
                "keywords": [
                    "energy"
                ],
                "published_date": "23 October 2024"
            },
            {
                "heading": "Shell Buys US Power Plant for Foothold in New England Market",
                "excerpt": "Shell Energy North America (US), a subsidiary of Shell Plc (NYSE:SHEL), has agreed to acquire a 100% equity stake in RISEC Holdings, LLC, owner of…",
                "keywords": [
                    "energy"
                ],
                "published_date": "23 October 2024"
            },
            {
                "heading": "Why Is Smart Money Betting Against Renewable Energy",
                "excerpt": "Last week, we reported that bearish sentiment in oil markets had sunk to levels last seen during the 2008 global financial crisis. According to commodity…",
                "keywords": [
                    "oil"
                ],
                "published_date": "22 October 2024"
            },
            {
                "heading": "Deepwater Investments Outpacing Shale",
                "excerpt": "Over the past two decades, the shale revolution largely pushed aside interest in the exploration and development of offshore hydrocarbons. The combination of hydraulic fracturing…",
                "keywords": [],
                "published_date": "21 October 2024"
            },
            {
                "heading": "Oil Markets Fail to Respond to Geopolitical Escalations",
                "excerpt": "Ten days ago, the Biden administration expanded sanctions on Iran’s petroleum and petrochemical sectors in response to Iran’s October 1 attack on Israel, its second…",
                "keywords": [],
                "published_date": "21 October 2024"
            },
            {
                "heading": "Oil Prices Gain 2% After China Boosts Stimulus Measures",
                "excerpt": "Oil markets have kicked off the new week on a strong footing with oil prices climbing after Chinese banks adopted extra stimulus measures in a…",
                "keywords": [
                    "oil"
                ],
                "published_date": "21 October 2024"
            },
            {
                "heading": "EU Set To Launch Critical Minerals Joint Buying Platform",
                "excerpt": "The European Union has kicked off the process of choosing between eight bidders that supply its 9-million-euro joint purchasing platform for critical minerals and energy,…",
                "keywords": [
                    "energy",
                    "supply"
                ],
                "published_date": "21 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "barrel",
                3
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Record-Shale-Production-Helps-ConocoPhillips-Beat-Profit-Estimates.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Oil prices are climbing as… Charles Kennedy Charles is a writer for Oilprice.com More Info ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total oil and gas production and record output in the U.S. shale patch. The U.S. oil and gas producerreportedon Thursday adjusted earnings per share of $1.78 for the third quarter, down from $2.16 EPS a year earlier, but above the analyst consensusestimate of $1.65compiled by The Wall Street Journal. Higher crude oil and natural gas production helped ConocoPhillips offset the lower oil and gas prices compared to last year. The impact of lower oil and gas prices was evident in the company’s total average realized price, which was $54.18 per barrel of oil equivalent (boe), 10% lower than the $60.05 per boe realized in the third quarter of 2023. But ConocoPhillips’s production for the third quarter of 2024 averaged 1.917 million barrels of oil equivalent per day (boed), up by 3% from the same period a year ago when adjusted for closed acquisitions and dispositions. The producer achieved record Lower 48 production of 1.147 million boed, including 781,000 boed from the Permian, 246,000 boed from the Eagle Ford, and 107,000 boed from the Bakken. Total fourth-quarter 2024 production is expected to be 1.99-2.03 million boed, ConocoPhillips said, as it also raised its full-year production guidance to 1.94-1.95 million boed, as compared to prior guidance of 1.93 million boed to 1.94 million boed. ConocoPhillips’s board has decided to raise its ordinary dividend by 34% to $0.78 per share and increase the existing share repurchase authorization by up to $20 billion. The company is on track to distribute at least $9 billion to shareholders for 2024, chairman and CEO Ryan Lance said. ConocoPhillips continues to anticipate closing theplanned acquisition of Marathon Oilthis quarter and expects to significantly exceed its initial $500 million synergy guidance, the executive added. Following the results release, shares in ConocoPhillips jumped by 3% in pre-market trade in New York. By Charles Kennedy for Oilprice.com | Previous Post Rosneft to Resume Output at Idled Black Sea Refinery in November Next Post Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 10:29",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "price",
                3
            ],
            [
                "barrel",
                3
            ],
            [
                "investment",
                3
            ]
        ]
    },
    {
        "headline": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Rosneft-to-Resume-Output-at-Idled-Black-Sea-Refinery-in-November.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Oil prices declined after Israel's… Charles Kennedy Charles is a writer for Oilprice.com More Info Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because of poor refining margins, industry sources toldReuterson Thursday. The export-oriented refinery has halted crude processing since October 1 because of low refining margins, industry sources toldReutersin early October. In November, the refinery is expected to resume operations and process into fuels as much as 480,000 metric tons of crude oil, traders told Reuters. The Tuapse refinery has a capacity to process 240,000 barrels per day (bpd) of crude oil. The processing facility mostly exports its production of naphtha, high-sulfur diesel, fuel oil, and vacuum gasoil to Turkey, China, Malaysia, and Singapore. It doesn’t contribute to Russia’s domestic supply of gasoline or diesel. The halt of the refinery, due to low margins, helped raise the idled refining capacity across Russia in October. Russia has raised the refining capacity volumes it expects to be idle in Octoberby 67%compared to an earlier plan, due to scheduled maintenance at major refineries, Reuters estimates showed earlier this month. The Tuapse refinery has also been a target ofUkrainian drone attacksthis year, which have caused damage at the site. The latest such attack at Tuapse occurred in July when the refinery was damaged in a massive Ukrainian drone attack. In January, a previous attack had also caused damage at the biggest Black Sea refinery of Russian oil giant Rosneft. Ukrainian attacks on Russian oil refineries and other energy infrastructure have become a fixture this year, with drones the weapon of choice for conducting the strikes. But a Financial Times report from earlier this week said that Russia and Ukraine are in the very early stages of Qatar-mediatedtalks about halting attackson each other’s energy facilities and infrastructure. By Charles Kennedy for Oilprice.com | Previous Post Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall Next Post Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 09:52",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Canadian-Natural-Resources-Q3-Profit-Slips-as-Oil-and-Gas-Prices-Fall.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Ford reports strong Q3 revenue… Charles Kennedy Charles is a writer for Oilprice.com More Info Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a year earlier amid plunging natural gas prices in North America and lower international crude oil prices. Canadian Naturalsaidon Thursday that its adjusted net earnings from operations for the third quarter stood at US$1.5 billion (C$2.1 billion), down compared with US$2 billion (C$2.85 billion) for the third quarter of 2023. The oil and gas producer attributed the decline to lower crude oil and NGLs sales volumes and netbacks in North America, lower natural gas pricing in North America, and lower realized prices for its synthetic crude from the oil sands production. Natural gas prices in Canada and the United States continued to decline as a result of high storage levels in 2024, the company’s management said in the discussion of the third-quarter results. Third-quarter natural gas production dropped by 5% year-over-year, while the realized natural gas price slumped by 56%. Crude oil and NGL realized prices fell by 10%, while realized sales prices from the oil sands production fell by 7% in the third quarter from a year earlier. “Although inflationary pressures are easing, the Company has experienced and may continue to experience inflationary pressures on its operating and capital expenditures in addition to higher than normal fluctuations in commodity prices and interest rates,” Canadian Natural Resources said. Due to low natural gas prices, Canadian Natural now targets to drill a total of 74 net natural gas wells in 2024. This number will be 17 fewer wells than targeted in the original 2024 budget, the companysaid. After the Q3 reporting period ended, Canadian Natural agreed in early October to buy oil sands and shale assets in Canada from U.S. supermajor Chevron in a$6.5 billioncash deal. By Charles Kennedy for Oilprice.com | Previous Post Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Next Post Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 09:29",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "revenue",
                4
            ],
            [
                "production",
                3
            ],
            [
                "price",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Aston-Martins-Pre-Tax-Losses-Plummet-by-90-in-Q3.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating While ceasefire are set to… City A.M CityAM.com is the online presence of City A.M., London's first free daily business newspaper. Both platforms cover financial and business news as well as sport and… More Info Aston Martin's pre-tax loss was 90 percent lower during its latest financial period, boosted by a rise in wholesale volumes. The Warwickshire-headquartered luxury car maker has reported a pre-tax loss of £12.2m for its third quarter, down from the £117.6m loss it posted during the same three-month period in 2022. New figuresfiled with the London Stock Exchange also show that Aston Martin’s revenue increased by eight percent to £391.6m over the same period. In a statement, the company said that it has been battling supply chain disruption and weakness in the key Chinese market. Wholesale volumes for the carmaker were 1,641 for the period ending September 30, up 14 percent year-on-year. However, total wholesale volumes for the year-to-date are 17 percent down on 2023, standing at 3,639. Chief executive Adrian Hallmark said: “Having only joined Aston Martin in September, I can already clearly see growth opportunities for the company as we bring incredible products to market and deliver on our vision to be the world’s most desirable, ultra-luxury British performance brand. “We recently launched Vanquish, successfully completing the most diverse, dynamic and desirable portfolio in the luxury segment. “Recent media reviews of our V12 flagship highlights the strength of Aston Martin’s products, which now truly align with our ultra-luxury high performance strategy. “Long-term value creation and sustainable growth are key priorities as we look forward to Q4 2024 and beyond. “We will deliver our fully reinvigorated portfolio to market efficiently and maximise the considerable commercial potential, including greater personalisation opportunities, to further strengthen the order book. “In addition, we will drive profitability through a forensic approach to cost management and unrelenting focus on quality with a more balanced delivery profile in the future for our full range of new core models. “Improved financial and operational performance in Q3 2024, demonstrates our strategy’s effectiveness. “We are on track to meet our revised full year 2024 guidance, which reflects the necessary action taken in September to adjust our production volumes given supplier disruption, which we are proactively managing, and the weak macroeconomic environment in China.” By City AM | Previous Post Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices Next Post Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices CityAM.com is the online presence of City A.M., London's first free daily business newspaper. Both platforms cover financial and business news as well as sport and… More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 08:37",
        "author": "City A.M",
        "author_bio": "CityAM.comis the online presence of City A.M., London's first free daily business newspaper. Both platforms cover financial and business news as well as sport and contemporary lifestyle.",
        "contributor_since": "07 Oct 2016",
        "other_articles": [
            {
                "heading": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3",
                "excerpt": "Aston Martin's pre-tax loss was 90 percent lower during its latest financial period, boosted by a rise in wholesale volumes. The Warwickshire-headquartered luxury car maker…",
                "keywords": [
                    "rise",
                    "loss"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Eurozone Economy Exceeds Expectations with Strong Q3 Growth",
                "excerpt": "The eurozone grew twice as fast as economists expected in the third quarter, new figures show, as Germany managed to skirt a recession. New ‘flash’…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Small Nuclear Reactors to Power Czech Republic's Green Energy Shift",
                "excerpt": "Rolls-Royce has sold a minority stake in its small nuclear reactor division to Czech power company CEZ. The Derby-headquartered giant has handed a 20 per…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP and Shell Brace for Profit Drop",
                "excerpt": "BP and Shell are expected to post lower profits this week as the supermajors grapple with weak oil prices and a global slowdown in demand.…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Gold Supply and Demand Imbalance Fuels Price Surge",
                "excerpt": "Gold prices surged to an all-time high of $2,730 (£2,093) this morning as investors sought safe-haven assets amid rising geopolitical tensions. This means that the…",
                "keywords": [],
                "published_date": "21 October 2024"
            },
            {
                "heading": "UK Accelerates Energy  'Skills Passport' for Renewable Transition",
                "excerpt": "The energy secretary will speed up oil and gas workers being able to transition to jobs in the renewable energy industry via a “skills passport”…",
                "keywords": [
                    "energy",
                    "oil",
                    "gas"
                ],
                "published_date": "18 October 2024"
            },
            {
                "heading": "Barclays Pushes UK Government to Prioritize the Energy Transition",
                "excerpt": "Barclays has urged the UK government to prioritise three core actions to accelerate its transition and green finance efforts. As part of a report released…",
                "keywords": [],
                "published_date": "17 October 2024"
            },
            {
                "heading": "The UK’s £21.7 Billion Carbon Capture Gamble",
                "excerpt": "The government confirmed this month the funding for the UK’s first carbon capture sites. The technology, it is claimed, captures CO2 emissions before they reach…",
                "keywords": [],
                "published_date": "16 October 2024"
            },
            {
                "heading": "UK Government \"Absolutely Ready to Engage\" With Musk",
                "excerpt": "Technology Secretary Peter Kyle has suggested that Elon Musk was not invited to the government’s international investment summit due to his tendency to avoid such…",
                "keywords": [
                    "investment"
                ],
                "published_date": "14 October 2024"
            },
            {
                "heading": "Banking Giants Claim It Is Time to Invest in Britain",
                "excerpt": "Bosses at five of the world’s biggest banks, along with a host of insurers, private equity firms and tech giants, have backed a push to…",
                "keywords": [],
                "published_date": "14 October 2024"
            },
            {
                "heading": "Aston Martin's Production Targets Slashed, Short Sellers Pounce",
                "excerpt": "Short sellers are circling Aston Martin after the iconic marque issued a profit warning last month and said it would produce around 1,000 less cars…",
                "keywords": [
                    "profit"
                ],
                "published_date": "10 October 2024"
            },
            {
                "heading": "Rio Tinto Expands into Lithium Market with $6.7 Billion Acquisition",
                "excerpt": "Rio Tinto is set to acquire the chemical producer Arcadium Lithium in a $6.7bn (£5.12bn) deal. The multinational mining behemoth announced the all-cash transaction this…",
                "keywords": [],
                "published_date": "09 October 2024"
            },
            {
                "heading": "3i Infrastructure to Divest Stake in French Green Energy Firm",
                "excerpt": "FTSE 250 investment trust 3i Infrastructure is poised to sell its stake in French independent green energy operator Valorem in a deal worth around €309m…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "07 October 2024"
            },
            {
                "heading": "Net Zero by 2050: UK's Carbon Capture Push Gets £22 Billion Boost",
                "excerpt": "The UK is set to invest almost £22bn over 25 years in carbon capture and storage schemes, Sir Keir Starmer is to announce ahead of…",
                "keywords": [],
                "published_date": "04 October 2024"
            },
            {
                "heading": "Beyond Coal: The Future of UK's Electricity Supply",
                "excerpt": "A quiet revolution occurred in the very earliest moments of this morning, probably while you were asleep. You went to bed in one sort of…",
                "keywords": [],
                "published_date": "03 October 2024"
            },
            {
                "heading": "FTSE 100 Outperforms Global Indices as Defense and Energy Stocks Rally",
                "excerpt": "London markets made gains on Wednesday morning after an unprecedented missile attack on Israel by Iran that sent oil prices higher and shook global stocks.…",
                "keywords": [
                    "oil"
                ],
                "published_date": "02 October 2024"
            },
            {
                "heading": "Falling Energy Prices Drive Eurozone Inflation Below 2% Goal",
                "excerpt": "Eurozone inflation fell below the two per cent target for the first time since mid-2021, paving the way for the European Central Bank (ECB) to…",
                "keywords": [],
                "published_date": "01 October 2024"
            },
            {
                "heading": "UK Car Factories Gear Up for Electric Shift",
                "excerpt": "Car production fell last month, continuing a trend seen across the year, new figures show. The number of cars built in UK factories was 8.4…",
                "keywords": [
                    "production"
                ],
                "published_date": "27 September 2024"
            },
            {
                "heading": "UK Says Goodbye to Coal",
                "excerpt": "The UK’s last remaining coal-fired power station is to shut at the end of September, drawing to a close Britain’s 142-year reliance on the fossil…",
                "keywords": [],
                "published_date": "26 September 2024"
            },
            {
                "heading": "Will China’s New Stimulus Package Be Enough?",
                "excerpt": "China has unveiled its largest set of economic stimulus measures since the pandemic in an attempt to kickstart growth in the world’s second largest economy.…",
                "keywords": [
                    "economy"
                ],
                "published_date": "24 September 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "rise",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "revenue",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "loss",
                2
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Cheniere-Energy-Q3-Earnings-Dip-on-Lower-LNG-and-Gas-Prices.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Rolls-Royce sells a minority stake… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and lower international LNG and natural gas prices. Cheniere Energybooked$3.763 billion in total revenues for Q3, down from $4.159 billion for the same period last year. LNG revenues dropped to $3.554 billion from $3.974 billion, amid “significant declines of historic volatility in international gas prices and moderated and sustained spot prices in the current periods relative to the same periods of 2023,” the company said in an SEC filing. Net income attributable to Cheniere nearly halved to $893 million, down from $1.7 billion a year earlier. The company attributed the decline to lower sales volumes under short-term agreements as a higher proportion of its LNG was sold under long-term contracts. The drop in revenues was the result of declining international LNG and gas prices and a reduction of volumes sold under short-term agreements as a result of additional long-term agreements commencing after the third quarter of 2023, Cheniere Energy said. Part of the decline was attributable to decliningHenry Hub pricing, the U.S. natural gas benchmark, to which the majority of Cheniere’s long-term LNG sales contracts are indexed. Lower LNG and natural gas prices, as well as lower margins for delivered LNG cargoes, have beenweighingon Cheniere’s earnings this year. The company, however, is upbeat about long-term LNG demand, especially in Asia, which is the key growth driver of LNG consumption globally. Chinese demand for natural gasis set to jumpby more than 50% by 2040, from 400 billion cubic meters (bcm) now to more than 600 bcm, Yingying Zhou, director of LNG origination at Cheniere, said last week. Cheniere expects China to become the world’s first market with 100 million tons of LNG demand very soon. LNG will represent about 25%-30% of China’s total natural gas demand, the executive added. China, which has surpassed Japan in recent years to become the world’s largest LNG importer, will be a key growth driver of global LNG demand growth, industry analysts and major LNG traders say. By Tsvetana Paraskova for Oilprice.com | Previous Post TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices Next Post Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 08:33",
        "author": "Tsvetana Paraskova",
        "author_bio": "Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews.",
        "contributor_since": "13 Jul 2016",
        "other_articles": [
            {
                "heading": "The U.S. LNG Export Boom Faces Challenges",
                "excerpt": "The U.S. LNG export industry has recently hit several stumbling blocks. And who will be America’s president in the next four years may not even…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Panama Canal Bets on Asian Demand to Boost Flailing LNG Traffic",
                "excerpt": "After a year of traffic restrictions and upended global trade flows due to geopolitical shifts, the Panama Canal – the fastest route for American LNG…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
                "excerpt": "The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and…",
                "keywords": [
                    "energy",
                    "decline"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
                "excerpt": "Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergies reported…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
                "excerpt": "Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
                "excerpt": "Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak…",
                "keywords": [
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
                "excerpt": "The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French…",
                "keywords": [
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
                "excerpt": "A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
                "excerpt": "Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Times…",
                "keywords": [
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
                "excerpt": "Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Vows to Maintain Its Status as an Oil Giant",
                "excerpt": "As Saudi Arabia prepares to tender 44 gigawatts (GW) of renewable energy projects, it will continue to maintain its oil-producing potential to ensure global energy…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
                "excerpt": "Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply…",
                "keywords": [
                    "supply"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
                "excerpt": "Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil…",
                "keywords": [
                    "energy",
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
                "excerpt": "BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil…",
                "keywords": [
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Hydrogen Stocks Crash as Hype Faces Reality Check",
                "excerpt": "The low-carbon hydrogen hype has begun to fade in recent months as companies and investors realize that their ambitions face the reality of costly projects…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oman’s Oil Exploration Firm Plunges After Record $2-Billion IPO",
                "excerpt": "After a record $2-billion initial public offering, OQ Exploration and Production Company (OQEP), Oman’s wholly-state-owned upstream oil and gas operator, fell by more than 8%…",
                "keywords": [
                    "oil",
                    "gas",
                    "production"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China’s Oil Giant CNOOC Books Record Q3 Profit as Production Jumps",
                "excerpt": "Despite lower international oil prices, Chinese state-held oil and gas giant CNOOC reported on Monday its highest-ever profit for the third quarter, on the back…",
                "keywords": [
                    "oil",
                    "gas",
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "PetroChina Set to Close Its Biggest Refinery in 2025",
                "excerpt": "State oil giant PetroChina plans to shut its largest Chinese refinery in 2025 after years of considering moving the processing to a smaller site, anonymous…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China Ramps Up Coal Power as Energy Demand Surges",
                "excerpt": "Although the share of coal in China’s electricity generation has been declining in recent years with the renewables boom, Chinese coal power generation and demand…",
                "keywords": [
                    "demand"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "EU and China Continue Talks on EV Tariffs Alternative",
                "excerpt": "The European Union and China agreed on Friday to continue discussions on a possible alternative to the EU import tariffs on China-made electric vehicles, a…",
                "keywords": [],
                "published_date": "25 October 2024"
            }
        ],
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/TotalEnergies-Misses-Profit-Forecast-on-Weak-Refining-and-Low-Oil-Prices.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Egypt, a major energy player… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergiesreportedon Thursday an adjusted net income of $4.1 billion for the third quarter, down by 13% from the second quarter, and down from $6.45 billion a year earlier. The earnings, TotalEnergies’s lowest quarterly profit in three years, missed the analyst estimate of $4.27 billion. After the results were published, TotalEnergies shares slumped by 2.5% in Paris and its New York-listed shares were down by 1.5% in pre-market trade. Weak refining margins dented the French supermajor’s earnings. Lower oil prices and unplanned production outages in Libya and the Ichtys LNG project in Australia combined with the weakening downstream business to drag profits below analyst forecasts. The company’s oil and gas production averaged 2.409 million barrels of oil equivalent per day (boepd) in the third quarter 2024, down by 1% quarter-to-quarter, as unplanned shutdowns in Ichthys LNG and security-related disruptions in Libya couldn’t fully offset the ramp-up at the Mero 2 project in Brazil. TotalEnergies had alreadyflaggedweak refining margins as the key drivers of expected lower third-quarter results. The other European supermajors, BP and Shell, have also warned of the weaker refining environment, but they bothbeat analyst estimateswhen they reported Q3 earnings this week. At TotalEnergies, the “very sharp decrease in refining margins in Europe (-66% quarter-to-quarter) and in the Rest of the World”, dragged down the downstream division’s adjusted net operating income and cash flow by around 40% quarter-over-quarter, CEO Patrick Pouyanné said. Marketing and trading activities partly compensated for the very sharp decline in refining, the executive added. Despite the drop in earnings, TotalEnergies is keeping its pace of share buybacks, announcing repurchases of $2 billion in the fourth quarter of 2024, in line with its target to reach a total of $8 billion buybacks throughout the year. The supermajor also confirmed its net investment guidance of $17 billion-$18 billion in 2024. By Tsvetana Paraskova for Oilprice.com | Previous Post IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts Next Post Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 08:28",
        "author": "Tsvetana Paraskova",
        "author_bio": "Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews.",
        "contributor_since": "13 Jul 2016",
        "other_articles": [
            {
                "heading": "The U.S. LNG Export Boom Faces Challenges",
                "excerpt": "The U.S. LNG export industry has recently hit several stumbling blocks. And who will be America’s president in the next four years may not even…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Panama Canal Bets on Asian Demand to Boost Flailing LNG Traffic",
                "excerpt": "After a year of traffic restrictions and upended global trade flows due to geopolitical shifts, the Panama Canal – the fastest route for American LNG…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
                "excerpt": "The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and…",
                "keywords": [
                    "energy",
                    "decline"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
                "excerpt": "Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergies reported…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
                "excerpt": "Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
                "excerpt": "Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak…",
                "keywords": [
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
                "excerpt": "The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French…",
                "keywords": [
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
                "excerpt": "A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
                "excerpt": "Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Times…",
                "keywords": [
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
                "excerpt": "Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Vows to Maintain Its Status as an Oil Giant",
                "excerpt": "As Saudi Arabia prepares to tender 44 gigawatts (GW) of renewable energy projects, it will continue to maintain its oil-producing potential to ensure global energy…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
                "excerpt": "Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply…",
                "keywords": [
                    "supply"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
                "excerpt": "Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil…",
                "keywords": [
                    "energy",
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
                "excerpt": "BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil…",
                "keywords": [
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Hydrogen Stocks Crash as Hype Faces Reality Check",
                "excerpt": "The low-carbon hydrogen hype has begun to fade in recent months as companies and investors realize that their ambitions face the reality of costly projects…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oman’s Oil Exploration Firm Plunges After Record $2-Billion IPO",
                "excerpt": "After a record $2-billion initial public offering, OQ Exploration and Production Company (OQEP), Oman’s wholly-state-owned upstream oil and gas operator, fell by more than 8%…",
                "keywords": [
                    "oil",
                    "gas",
                    "production"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China’s Oil Giant CNOOC Books Record Q3 Profit as Production Jumps",
                "excerpt": "Despite lower international oil prices, Chinese state-held oil and gas giant CNOOC reported on Monday its highest-ever profit for the third quarter, on the back…",
                "keywords": [
                    "oil",
                    "gas",
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "PetroChina Set to Close Its Biggest Refinery in 2025",
                "excerpt": "State oil giant PetroChina plans to shut its largest Chinese refinery in 2025 after years of considering moving the processing to a smaller site, anonymous…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China Ramps Up Coal Power as Energy Demand Surges",
                "excerpt": "Although the share of coal in China’s electricity generation has been declining in recent years with the renewables boom, Chinese coal power generation and demand…",
                "keywords": [
                    "demand"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "EU and China Continue Talks on EV Tariffs Alternative",
                "excerpt": "The European Union and China agreed on Friday to continue discussions on a possible alternative to the EU import tariffs on China-made electric vehicles, a…",
                "keywords": [],
                "published_date": "25 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "profit",
                4
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/IMF-Cuts-Middle-East-Growth-Outlook-on-Oil-Output-Cuts-and-Conflicts.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Egypt, a major energy player… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil production cuts, the International Monetary Fund (IMF)saidon Thursday, slashing its GDP growth view by 0.6 percentage point compared to an April forecast. High uncertainty over economic growth in the MENA region in the near and medium term persists, with key risks including escalating conflicts, increased geo-economic fragmentation, and commodity price volatility, the IMF said in its latest regional report on the Middle East and Central Asia. The MENA region’s economic growth is expected to rebound next year, with GDP growth seen at 4%, slightly lower compared to the forecast from the previous regional outlook in April. However, the rebound in economic growth next year is conditional on OPEC+ reversing its oil production cuts and easing headwinds for economies in the region, including those from conflicts, the IMF noted. “MENA oil exporters have navigated the global landscape well, but the twin surpluses that helped cushion recent shocks have started to narrow amid ambitious investment strategies and falling oil revenues,” the fund’s analysts wrote. Among the region’s oil exporters, economic growth is forecast to strengthen to 2.3% this year, up from 1.7% in 2023, and further to 4% next year. However, the IMF has now revised down its near-term outlook for 2024 and 2025 by 0.6 and 0.4 percentage points, respectively, from the April forecast, mainly reflecting the extension of voluntary oil production cuts in most GCC countries, Algeria, and Iraq. “Moreover, growth is forecast to moderate to 3 percent over the medium term, as the non-oil sector only gradually generates momentum,” the IMF said. OPEC+ currently plans to begin reversing the oil production cuts in December and have these reversed in full by September 2025. However, weaker oil demand and lower oil priceshave raised questionsabout whether the alliance would go through with this plan. By Tsvetana Paraskova for Oilprice.com | Previous Post Shell Beats Expectations as Strong Gas Sales Offset Weak Refining Next Post TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 07:00",
        "author": "Tsvetana Paraskova",
        "author_bio": "Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews.",
        "contributor_since": "13 Jul 2016",
        "other_articles": [
            {
                "heading": "The U.S. LNG Export Boom Faces Challenges",
                "excerpt": "The U.S. LNG export industry has recently hit several stumbling blocks. And who will be America’s president in the next four years may not even…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Panama Canal Bets on Asian Demand to Boost Flailing LNG Traffic",
                "excerpt": "After a year of traffic restrictions and upended global trade flows due to geopolitical shifts, the Panama Canal – the fastest route for American LNG…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
                "excerpt": "The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and…",
                "keywords": [
                    "energy",
                    "decline"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
                "excerpt": "Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergies reported…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
                "excerpt": "Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
                "excerpt": "Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak…",
                "keywords": [
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
                "excerpt": "The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French…",
                "keywords": [
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
                "excerpt": "A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
                "excerpt": "Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Times…",
                "keywords": [
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
                "excerpt": "Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Vows to Maintain Its Status as an Oil Giant",
                "excerpt": "As Saudi Arabia prepares to tender 44 gigawatts (GW) of renewable energy projects, it will continue to maintain its oil-producing potential to ensure global energy…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
                "excerpt": "Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply…",
                "keywords": [
                    "supply"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
                "excerpt": "Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil…",
                "keywords": [
                    "energy",
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
                "excerpt": "BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil…",
                "keywords": [
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Hydrogen Stocks Crash as Hype Faces Reality Check",
                "excerpt": "The low-carbon hydrogen hype has begun to fade in recent months as companies and investors realize that their ambitions face the reality of costly projects…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oman’s Oil Exploration Firm Plunges After Record $2-Billion IPO",
                "excerpt": "After a record $2-billion initial public offering, OQ Exploration and Production Company (OQEP), Oman’s wholly-state-owned upstream oil and gas operator, fell by more than 8%…",
                "keywords": [
                    "oil",
                    "gas",
                    "production"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China’s Oil Giant CNOOC Books Record Q3 Profit as Production Jumps",
                "excerpt": "Despite lower international oil prices, Chinese state-held oil and gas giant CNOOC reported on Monday its highest-ever profit for the third quarter, on the back…",
                "keywords": [
                    "oil",
                    "gas",
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "PetroChina Set to Close Its Biggest Refinery in 2025",
                "excerpt": "State oil giant PetroChina plans to shut its largest Chinese refinery in 2025 after years of considering moving the processing to a smaller site, anonymous…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China Ramps Up Coal Power as Energy Demand Surges",
                "excerpt": "Although the share of coal in China’s electricity generation has been declining in recent years with the renewables boom, Chinese coal power generation and demand…",
                "keywords": [
                    "demand"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "EU and China Continue Talks on EV Tariffs Alternative",
                "excerpt": "The European Union and China agreed on Friday to continue discussions on a possible alternative to the EU import tariffs on China-made electric vehicles, a…",
                "keywords": [],
                "published_date": "25 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "production",
                3
            ],
            [
                "price",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Shell-Beats-Expectations-as-Strong-Gas-Sales-Offset-Weak-Refining.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating China's oil and steel sectors… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak refining margins in the downstream business. Despite the lower crude prices and weaker refining margins, Shellbookedadjusted earnings of $6.0 billion, ahead of the analyst consensus estimate of $5.4 billion, and only slightly below the $6.2-billion earnings for the same period of 2023. Shell warned earlier this month that it expects lower refining margins and a loss in its chemicals businessto weighon its third-quarter earnings. These could be offset or partly offset by higher LNG production volumes, Shell said in its third quarter update note. Higher LNG liquefaction volumes and sales boosted the earnings of the Integrated Gas division, the results of Shell, the world’s top LNG trader, showed today. Amid lower crude oil prices and refining margins in Q3, the consensus-beating earnings “reflect strong operational performance in Integrated Gas, Upstream and Marketing,” the supermajor said. In view of the Q3 results, Shell began a new $3.5 billion share buyback program, expected to be completed by the Q4 2024 results announcement. Over the last 4 quarters, total shareholder distributions paid were 43% of cash flow from operations (CFFO). “We continue to deliver more value with less emissions, whilst enhancing the resilience of our balance sheet. Today, we announce another $3.5 billion buyback programme for the next three months, making this the 12th consecutive quarter in which we have announced $3 billion or more in buybacks,” CEO Wael Sawan said. Following the release of the results, Shell’s stock rose by 1.5% at opening in London. Earlier this week, the other UK-based supermajor, BP (NYSE: BP), also booked third-quarter earningsabove analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil prices and low refining margins. Compared with the second quarter of 2024, the earnings reflect “weaker realized refining margins, a weak oil trading result and lower liquids realizations, partly offset by higher gas realizations,” BP said in astatement, adding that the gas marketing and trading result was “average”. By Tsvetana Paraskova for Oilprice.com | Previous Post Exelon Reports 80% Surge in Data Center Power Supply Deals Next Post IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 06:20",
        "author": "Tsvetana Paraskova",
        "author_bio": "Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews.",
        "contributor_since": "13 Jul 2016",
        "other_articles": [
            {
                "heading": "The U.S. LNG Export Boom Faces Challenges",
                "excerpt": "The U.S. LNG export industry has recently hit several stumbling blocks. And who will be America’s president in the next four years may not even…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Panama Canal Bets on Asian Demand to Boost Flailing LNG Traffic",
                "excerpt": "After a year of traffic restrictions and upended global trade flows due to geopolitical shifts, the Panama Canal – the fastest route for American LNG…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
                "excerpt": "The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and…",
                "keywords": [
                    "energy",
                    "decline"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
                "excerpt": "Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergies reported…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
                "excerpt": "Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
                "excerpt": "Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak…",
                "keywords": [
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
                "excerpt": "The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French…",
                "keywords": [
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
                "excerpt": "A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
                "excerpt": "Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Times…",
                "keywords": [
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
                "excerpt": "Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Vows to Maintain Its Status as an Oil Giant",
                "excerpt": "As Saudi Arabia prepares to tender 44 gigawatts (GW) of renewable energy projects, it will continue to maintain its oil-producing potential to ensure global energy…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
                "excerpt": "Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply…",
                "keywords": [
                    "supply"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
                "excerpt": "Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil…",
                "keywords": [
                    "energy",
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
                "excerpt": "BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil…",
                "keywords": [
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Hydrogen Stocks Crash as Hype Faces Reality Check",
                "excerpt": "The low-carbon hydrogen hype has begun to fade in recent months as companies and investors realize that their ambitions face the reality of costly projects…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oman’s Oil Exploration Firm Plunges After Record $2-Billion IPO",
                "excerpt": "After a record $2-billion initial public offering, OQ Exploration and Production Company (OQEP), Oman’s wholly-state-owned upstream oil and gas operator, fell by more than 8%…",
                "keywords": [
                    "oil",
                    "gas",
                    "production"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China’s Oil Giant CNOOC Books Record Q3 Profit as Production Jumps",
                "excerpt": "Despite lower international oil prices, Chinese state-held oil and gas giant CNOOC reported on Monday its highest-ever profit for the third quarter, on the back…",
                "keywords": [
                    "oil",
                    "gas",
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "PetroChina Set to Close Its Biggest Refinery in 2025",
                "excerpt": "State oil giant PetroChina plans to shut its largest Chinese refinery in 2025 after years of considering moving the processing to a smaller site, anonymous…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China Ramps Up Coal Power as Energy Demand Surges",
                "excerpt": "Although the share of coal in China’s electricity generation has been declining in recent years with the renewables boom, Chinese coal power generation and demand…",
                "keywords": [
                    "demand"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "EU and China Continue Talks on EV Tariffs Alternative",
                "excerpt": "The European Union and China agreed on Friday to continue discussions on a possible alternative to the EU import tariffs on China-made electric vehicles, a…",
                "keywords": [],
                "published_date": "25 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "loss",
                2
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Exelon-Reports-80-Surge-in-Data-Center-Power-Supply-Deals.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 Uncertainty surrounds OPEC+ production plans… Charles Kennedy Charles is a writer for Oilprice.com More Info Exelon hasseenan 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving a surge in electricity demand in the U.S. The rise has materialized since the start of the year and has prompted debates about the distribution of costs associated with the expansion of grid infrastructure and the ramp-up of supply. In Exelon’s territory, demand for electricity from data center operators hit 11 GW in the third quarter, up from 6 GW in the second quarter, the company said in its third-quarter earnings call. Exelon has yet to build that capacity, which will be part of its investment plan, which stands at$34.5 billionfor the period until 2027. Reuters noted in a report on Exelon’s demand developments that the company is disputing a priority status granted by regulators to data center operators that locate their facilities on the sites of power plants—what’s commonly known as co-location. Currently, the Federal Energy Regulatory Commission allows the operators of such data centers to get hooked to the power plant directly, bypassing interconnection procedures. According to Exelon and fellow utility American Electric Power, this can lead to price hikes for other consumers and affect the reliability of the grid negatively. “We are not against co-locations,” Exelon CEO Calvin Butler said on a third-quarter company earnings call. “We just believe everyone should pay their fair share of utilizing the grid.” Data centers have become perhaps the biggest drivers of additional electricity demand in the United States, as Big Tech companies race to get ahead in the development of artificial intelligence systems. These consume enormous amounts of electricity that needs to be available on demand. This additional demand for reliable power has shined the spotlight on natural gas and nuclear as baseload alternatives to previous Big Tech darlings wind and solar. It has also highlighted the constraints of the grid that cannot be overcome quickly. By Charles Kennedy for Oilprice.com | Previous Post Petrobras Plans to Boost Investment to $110 Billion Between 2025 and 2029 Next Post Shell Beats Expectations as Strong Gas Sales Offset Weak Refining Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 05:00",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "rise",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "price",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Petrobras Plans to Boost Investment to $110 Billion Between 2025 and 2029",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Petrobras-Plans-to-Boost-Investment-to-110-Billion-Between-2025-and-2029.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating The U.S. national average gasoline… Irina Slav Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry. More Info Brazil’s Petrobras is considering a further increase in investment for the period between 2025 and 2029 to a total of $110 billion, unnamed sources in the know told Reuters. The sum would represent an 8% increase on earlier investment plans for the five years ahead. “Currently, the amount (under discussion) is near $107 billion, but there are adjustments remaining, so it is likely to be in the range of $110 billion,” one of the sources who spoke to Reuters said. Earlier, the companyreleasedplans to spend some $102 billion between 2024 and 2028, of which $73 billion was allocated for oil and gas exploration and production. Later in the year, however, Petrobrasreviseddown its spending plans for 2025, reducing the amount from $21 billion to $17 billion. The revision, Petrobras said, was more realistic and a better match for its financial resources. After spending a decade on selling off many assets outside Brazil, Petrobras is now shifting its strategy to portfolio diversification, keeping the focus on the most profitable assets, the company said earlier this year. Reserves replacement, new frontiers, and increased gas supply are all pillars of the new exploration and production strategy. Petrobras will also focus on production from existing fields, where depletion is eating into output and this is “bothering” the management, new CEO Magda Chambriardsaidrecently. To remedy matters, Petrobras will try to reverse the decline at mature fields such as the ones in the Campos Basin. The latest available production figures for Petrobras show 2.7 million barrels daily in oil equivalent for the second quarter of the year, up 2.4%, after a 25% slump earlier in the year due to platform maintenance. Petrobras is also adding production capacity: by the end of the year there should be an additional 500,000 bpd in such capacity available from three new floating production and storage vessels. By Irina Slav for Oilprice.com | Previous Post Exxon Sells Vaca Muerta Assets Next Post Exelon Reports 80% Surge in Data Center Power Supply Deals Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 04:10",
        "author": "Irina Slav",
        "author_bio": "Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry.",
        "contributor_since": "17 Jan 2016",
        "other_articles": [
            {
                "heading": "Drought Dashes Hopes For U.S. Hydropower Capacity",
                "excerpt": "Hydropower is, along with nuclear, the best of both worlds in terms of electricity. It is a zero-emission source of energy, and its output can…",
                "keywords": [
                    "energy"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Petrobras Plans to Boost Investment to $110 Billion Between 2025 and 2029",
                "excerpt": "Brazil’s Petrobras is considering a further increase in investment for the period between 2025 and 2029 to a total of $110 billion, unnamed sources in…",
                "keywords": [
                    "investment"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exxon Sells Vaca Muerta Assets",
                "excerpt": "Exxon has struck a deal with Argentinian Pluspetrol for the sale of the supermajor’s assets in the Vaca Muerta shale play. Reuters reported, citing an…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Gas Reigns Supreme in U.S. Grid",
                "excerpt": "Natural gas first emerged as a power generation fuel to replace dirtier coal. Lately, gas has cemented its reputation as the dominant source of reliable…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Oil Steady After EIA Confirms Draw in Crude, Gasoline Inventories",
                "excerpt": "Crude oil prices remained largely unchanged today, after the U.S. Energy Information Administration reported an inventory draw of a modest half a million barrels for…",
                "keywords": [
                    "oil",
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Oil Prices Remain Subdued on the Prospect of an Israel-Lebanon Ceasefire",
                "excerpt": "Crude oil prices remained subdued after falling to the lowest in a month earlier in the week, as Israel indicated it was ready to negotiate…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Turns to Debt Markets for Vision 2030 Financing",
                "excerpt": "A month ago, Saudi Arabia raised $3 billion from a fresh bond sale via its state oil major Aramco—the second for the kingdom since July—in…",
                "keywords": [
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "China Plans to Export 12.4% Less Fuel in November",
                "excerpt": "China plans to export 12.4% less refined petroleum products in November compared to this month, Chinese media report, citing a survey by OilChem. Total fuel…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "QatarEnergy Partners With TotalEnergy on Iraq Solar Project",
                "excerpt": "QatarEnergy will partner with French TotalEnergy on a solar power project in Iraq, part of a larger energy project planned by the supermajor. The two…",
                "keywords": [
                    "energy"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Mexico Sends Oil Cargo to Energy-Strapped Cuba",
                "excerpt": "A cargo of 400,000 barrels of crude has departed from Mexico en route to Cuba, which is reeling from fuel shortages and blackouts. Reuters reported…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Coal Remains On Its Throne Despite Transition Push",
                "excerpt": "Report upon report sings praises to energy transition efforts that are leading to record wind and solar electricity generation. Outside the spotlight, however, things look…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "LG Energy Reports 40% Drop in Profits as EV Demand Tanks",
                "excerpt": "South Korean battery major LG Energy Solution has reported a 40% drop in third-quarter profits, resulting from slowing demand for battery cars. The figure that…",
                "keywords": [
                    "energy",
                    "demand"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oil Prices Tumble as Tensions in the Middle East Cool",
                "excerpt": "Crude oil prices began the week with a loss, after Israel’s retaliatory strike against Iran failed to inflict substantial enough damage, according to the Iranian…",
                "keywords": [
                    "oil",
                    "loss"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oil Majors Return to Libya After a Decade Away",
                "excerpt": "BP and Eni have returned to Libya after ten years of avoiding the country amid its civil war. Per a statement by the National Oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "BP Walks Back Green Targets Amid Market Realities",
                "excerpt": "In February 2020, then-brand-new chief executive Bernard Looney told the world that one of the oldest and biggest oil companies in the world was going…",
                "keywords": [
                    "oil"
                ],
                "published_date": "26 October 2024"
            },
            {
                "heading": "Is the UK Taxing North Sea Oil and Gas Out of Existence?",
                "excerpt": "There is still plenty of oil and gas left in the UK’s North Sea. However, the industry needs a more favorable legislative context to get…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "India’s Oil Demand Set for 4% Rise in Q4",
                "excerpt": "India’s crude oil demand is about to add 4% during the final quarter of the year amid a festival season that also coincides with increased…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "UK and Australia to Team Up on Energy Transition Goals",
                "excerpt": "The UK and Australia will work together to pursue their energy transition goals, the prime ministers of the two countries said today. PMs Keir Starmer…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Oil Prices on Course for a Weekly Rise as Traders Refocus on Geopolitical Risk",
                "excerpt": "Crude oil prices were headed for a weekly jump this week fueled by geopolitical concerns as Chinese demand prospects took a back seat for a…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Big Tech's Nuclear Gamble Could Change The Course of the Energy Transition",
                "excerpt": "Microsoft recently struck a deal to restart of the Three Mile Island nuclear power plant. Google partnered with small modular reactor developer Kairos to build…",
                "keywords": [],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "production",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "decline",
                1
            ]
        ]
    },
    {
        "headline": "Exxon Sells Vaca Muerta Assets",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Exxon-Sells-Vaca-Muerta-Assets.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating India's surging energy demand and… Irina Slav Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry. More Info Exxon has struck a deal with Argentinian Pluspetrol for the sale of the supermajor’s assets in the Vaca Muerta shale play. Reutersreported, citing an unnamed source with the supermajor, that Exxon would sell Pluspetrol five blocks in the play plus its interest in oil pipeline operator Oleoductos del Valle. Reports of a possible sale of these assetsemergedin February this year, saying that Exxon was considering selling assets owned as part of a joint venture with QatarEnergy, including seven oil and gas blocks in the Vaca Muerta and holdings in the pipeline company. The assets are estimated to be valued at $1 billion at the time. The news followed a review of the Argentinian shale assets that Exxon conducted the previous year. At the time, Exxon said it was looking for farm-in investors, but didn’t rule out asset sales. “It is still premature to determine the final outcome of the ongoing review process, which runs parallel to our development commitments in the basin. It may not necessarily result in asset divestment,” according to a company source who spoke to the Oil & Gas Journal in August 2023. Exxon had drilled a total of 40 wells in the Dead Cow formation but only seven of those were producing. The company’s production stood at 7,300 barrels of oil and 103 million cu ft of natural gas daily as of February. The Vaca Muerta shale play is estimated to hold recoverable resources consisting of 16 billion barrels of oil and 308 trillion cubic feet of natural gas. Those numbers make the Vaca Muerta the world’s second-largest shale gas deposit. Totalproductionfrom the formation has grown from less than 90,000 bpd five years ago to 400,000 bpd this year, not least thanks to government policies under Javier Milei that have sought to boost foreign investment in Argentina’s energy industry. By Irina Slav for Oilprice.com | Previous Post Hess Beats Q3 Earnings Estimates On Robust Guyana Output Next Post Petrobras Plans to Boost Investment to $110 Billion Between 2025 and 2029 Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 31, 2024 at 02:51",
        "author": "Irina Slav",
        "author_bio": "Irina is a writer for Oilprice.com with over a decade of experience writing on the oil and gas industry.",
        "contributor_since": "17 Jan 2016",
        "other_articles": [
            {
                "heading": "Drought Dashes Hopes For U.S. Hydropower Capacity",
                "excerpt": "Hydropower is, along with nuclear, the best of both worlds in terms of electricity. It is a zero-emission source of energy, and its output can…",
                "keywords": [
                    "energy"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Petrobras Plans to Boost Investment to $110 Billion Between 2025 and 2029",
                "excerpt": "Brazil’s Petrobras is considering a further increase in investment for the period between 2025 and 2029 to a total of $110 billion, unnamed sources in…",
                "keywords": [
                    "investment"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exxon Sells Vaca Muerta Assets",
                "excerpt": "Exxon has struck a deal with Argentinian Pluspetrol for the sale of the supermajor’s assets in the Vaca Muerta shale play. Reuters reported, citing an…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Gas Reigns Supreme in U.S. Grid",
                "excerpt": "Natural gas first emerged as a power generation fuel to replace dirtier coal. Lately, gas has cemented its reputation as the dominant source of reliable…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Oil Steady After EIA Confirms Draw in Crude, Gasoline Inventories",
                "excerpt": "Crude oil prices remained largely unchanged today, after the U.S. Energy Information Administration reported an inventory draw of a modest half a million barrels for…",
                "keywords": [
                    "oil",
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Oil Prices Remain Subdued on the Prospect of an Israel-Lebanon Ceasefire",
                "excerpt": "Crude oil prices remained subdued after falling to the lowest in a month earlier in the week, as Israel indicated it was ready to negotiate…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Turns to Debt Markets for Vision 2030 Financing",
                "excerpt": "A month ago, Saudi Arabia raised $3 billion from a fresh bond sale via its state oil major Aramco—the second for the kingdom since July—in…",
                "keywords": [
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "China Plans to Export 12.4% Less Fuel in November",
                "excerpt": "China plans to export 12.4% less refined petroleum products in November compared to this month, Chinese media report, citing a survey by OilChem. Total fuel…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "QatarEnergy Partners With TotalEnergy on Iraq Solar Project",
                "excerpt": "QatarEnergy will partner with French TotalEnergy on a solar power project in Iraq, part of a larger energy project planned by the supermajor. The two…",
                "keywords": [
                    "energy"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Mexico Sends Oil Cargo to Energy-Strapped Cuba",
                "excerpt": "A cargo of 400,000 barrels of crude has departed from Mexico en route to Cuba, which is reeling from fuel shortages and blackouts. Reuters reported…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Coal Remains On Its Throne Despite Transition Push",
                "excerpt": "Report upon report sings praises to energy transition efforts that are leading to record wind and solar electricity generation. Outside the spotlight, however, things look…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "LG Energy Reports 40% Drop in Profits as EV Demand Tanks",
                "excerpt": "South Korean battery major LG Energy Solution has reported a 40% drop in third-quarter profits, resulting from slowing demand for battery cars. The figure that…",
                "keywords": [
                    "energy",
                    "demand"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oil Prices Tumble as Tensions in the Middle East Cool",
                "excerpt": "Crude oil prices began the week with a loss, after Israel’s retaliatory strike against Iran failed to inflict substantial enough damage, according to the Iranian…",
                "keywords": [
                    "oil",
                    "loss"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oil Majors Return to Libya After a Decade Away",
                "excerpt": "BP and Eni have returned to Libya after ten years of avoiding the country amid its civil war. Per a statement by the National Oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "BP Walks Back Green Targets Amid Market Realities",
                "excerpt": "In February 2020, then-brand-new chief executive Bernard Looney told the world that one of the oldest and biggest oil companies in the world was going…",
                "keywords": [
                    "oil"
                ],
                "published_date": "26 October 2024"
            },
            {
                "heading": "Is the UK Taxing North Sea Oil and Gas Out of Existence?",
                "excerpt": "There is still plenty of oil and gas left in the UK’s North Sea. However, the industry needs a more favorable legislative context to get…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "India’s Oil Demand Set for 4% Rise in Q4",
                "excerpt": "India’s crude oil demand is about to add 4% during the final quarter of the year amid a festival season that also coincides with increased…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "UK and Australia to Team Up on Energy Transition Goals",
                "excerpt": "The UK and Australia will work together to pursue their energy transition goals, the prime ministers of the two countries said today. PMs Keir Starmer…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Oil Prices on Course for a Weekly Rise as Traders Refocus on Geopolitical Risk",
                "excerpt": "Crude oil prices were headed for a weekly jump this week fueled by geopolitical concerns as Chinese demand prospects took a back seat for a…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Big Tech's Nuclear Gamble Could Change The Course of the Energy Transition",
                "excerpt": "Microsoft recently struck a deal to restart of the Three Mile Island nuclear power plant. Google partnered with small modular reactor developer Kairos to build…",
                "keywords": [],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Hess-Beats-Q3-Earnings-Estimates-On-Robust-Guyana-Output.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Natural gas prices experience a… Alex Kimani Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Leading U.S. shale operator,Hess Corp.(NYSE:HES), haspostedyet another impressive earnings report, with its stake in prolific Guyana helping it exceed estimates. Hess reported Q3 2024 non-GAAP EPS of $2.14, beating the Wall Street consensus by $0.37 while revenue of $3.2B (+12.7% Y/Y) beat by $160M. The company’s profits, however, fell slightly due to lower oil and gas prices: net income during the quarter clocked in at $498 million, or $1.62 per share, compared with net income of $504 million, or $1.64 per share, in the third quarter of 2023. Hess’ ongoing trend of rapid output growth from Guyana continued in the third quarter. Guyana net production clocked in at 170,000 barrels of oil per day (bopd), up 57% from 108,000 bopd in the third quarter of 2023. However, Guyana's output fell sequentially from the second quarter’s 192,000 bpd (+75% Y/Y) due to planned downtime. Meanwhile, Bakken net production was 206,000 boepd, up 8% from 190,000 boepd in the third quarter of 2023. Overall net production for the quarter was 461,000 boepd, compared with 395,000 boepd in the third quarter of 2023, primarily due to higher production in Guyana. Hess expects fourth quarter E&P net production to be in the range of 475,000 boepd to 485,000 boepd, primarily reflecting recovery from downtime in the third quarter of 2024 at Guyana and Southeast Asia partially offset by planned maintenance at the Tubular Bells production facility in the fourth quarter of 2024. The company also issued updated 2024 full year guidance, with E&P capital and exploratory expenditures expected to be ~$4.9 billion, up from previous guidance of $4.2 billion, reflecting the decision to accelerate the purchase of the Liza Destiny and Prosperity floating production, storage and offloading vessels (FPSOs) to the fourth quarter of 2024 instead of in 2025. Back in May, Hess shareholderssigned off onits proposed $53B merger withChevron Corp.(NYSE:CVX) despite the deal being challenged by its leading Guyana partner,Exxon Mobil Corp.(NYSE:XOM). By Alex Kimani for Oilprice.com | Previous Post U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold Next Post Exxon Sells Vaca Muerta Assets Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 13:13",
        "author": "Alex Kimani",
        "author_bio": "Alex Kimani is a veteran finance writer, investor, engineer and researcher for Safehaven.com.",
        "contributor_since": "28 Jan 2019",
        "other_articles": [
            {
                "heading": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating",
                "excerpt": "U.S oil and gas prices have taken divergent trajectories, with oil prices rebounding while natural gas prices have continued to fall in Thursday’s session. Oil…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Iran’s Energy Infrastructure More Vulnerable To Future Attacks",
                "excerpt": "Two days ago, benchmark crude oil futures fell by their largest one-day margin in more than two years after Israel launched limited retaliatory attacks on…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Hess Beats Q3 Earnings Estimates On Robust Guyana Output",
                "excerpt": "Leading U.S. shale operator, Hess Corp. (NYSE:HES), has posted yet another impressive earnings report, with its stake in prolific Guyana helping it exceed estimates. Hess…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "China’s Oil and Steel Industries Are in the Red. What Now?",
                "excerpt": "China has seen very mixed fortunes from its commodities markets, which have been languishing under a long-running crisis in the property sector, according to The…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "U.S. To Buy 3 Million Barrels for The SPR, But There’s A Problem",
                "excerpt": "The U.S. Department of Energy (DoE) is seeking to purchase 3 million barrels of crude oil for the Strategic Petroleum Reserve (SPR), the latest in…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "As Oil Job Losses Mount, Steelworkers Union Looks to Clean Energy",
                "excerpt": "The United Steelworkers union is counting on renewable energy projects to offset job losses at oil refining and petrochemical plants, a union official has told…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "The Biden Administration Just Approved Its First Lithium Mine",
                "excerpt": "Last week, the Rhyolite Ridge Lithium-Boron Project in Nevada became the first-ever lithium mine to receive the green light from the Biden administration. Shares of…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oil Continues Downward Slide Shedding Over 6%",
                "excerpt": "Oil markets have continued the downward spiral, with oil prices falling dramatically after Israel launched limited attacks on Iran. Supreme Leader Ayatollah Ali Khamenei helped…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Natural Gas Prices Plummet 11% as Israel-Iran Conflict Cools",
                "excerpt": "U.S. natural gas prices crashed on Monday after Israel launched limited attacks on Iran while Supreme Leader Ayatollah Ali Khamenei helped cool tensions after he…",
                "keywords": [
                    "gas"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "USGS Finds Enough Lithium to Meet Annual Demand Nine Times Over",
                "excerpt": "The United States Geological Survey (USGS) and the Arkansas Department of Energy and Environment's Office of the State Geologist have discovered a vast lithium reserve…",
                "keywords": [
                    "energy"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "U.S. Allies Unite for Critical Minerals Marketplace",
                "excerpt": "Earlier in the week, Reuters reported that the European Union has kicked off the process of choosing between eight bidders to create a 9-million-euro joint…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Mckinsey: Europe's Data Center Power Demand To Triple By 2030",
                "excerpt": "Europe's data center power consumption is expected to almost triple by 2030 and will require a surge in electricity—supply mostly from low-carbon sources coupled with…",
                "keywords": [
                    "supply"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Standard Chartered: Global Oil Demand Hit An All-Time High In August",
                "excerpt": "Momentum in oil markets has continued to skew towards the downside over the past two weeks, with the last 10 trading days seeing front-month Brent…",
                "keywords": [
                    "oil"
                ],
                "published_date": "23 October 2024"
            },
            {
                "heading": "Harbour Energy Joins North Sea Oil Exodus Ahead Of Tax Hikes",
                "excerpt": "Top British North Sea producer Harbour Energy (OTCPK:PMOIF) has revealed plans to sell stakes in North Sea oilfields and has revived plans for a U.S.…",
                "keywords": [
                    "energy"
                ],
                "published_date": "23 October 2024"
            },
            {
                "heading": "Shell Buys US Power Plant for Foothold in New England Market",
                "excerpt": "Shell Energy North America (US), a subsidiary of Shell Plc (NYSE:SHEL), has agreed to acquire a 100% equity stake in RISEC Holdings, LLC, owner of…",
                "keywords": [
                    "energy"
                ],
                "published_date": "23 October 2024"
            },
            {
                "heading": "Why Is Smart Money Betting Against Renewable Energy",
                "excerpt": "Last week, we reported that bearish sentiment in oil markets had sunk to levels last seen during the 2008 global financial crisis. According to commodity…",
                "keywords": [
                    "oil"
                ],
                "published_date": "22 October 2024"
            },
            {
                "heading": "Deepwater Investments Outpacing Shale",
                "excerpt": "Over the past two decades, the shale revolution largely pushed aside interest in the exploration and development of offshore hydrocarbons. The combination of hydraulic fracturing…",
                "keywords": [],
                "published_date": "21 October 2024"
            },
            {
                "heading": "Oil Markets Fail to Respond to Geopolitical Escalations",
                "excerpt": "Ten days ago, the Biden administration expanded sanctions on Iran’s petroleum and petrochemical sectors in response to Iran’s October 1 attack on Israel, its second…",
                "keywords": [],
                "published_date": "21 October 2024"
            },
            {
                "heading": "Oil Prices Gain 2% After China Boosts Stimulus Measures",
                "excerpt": "Oil markets have kicked off the new week on a strong footing with oil prices climbing after Chinese banks adopted extra stimulus measures in a…",
                "keywords": [
                    "oil"
                ],
                "published_date": "21 October 2024"
            },
            {
                "heading": "EU Set To Launch Critical Minerals Joint Buying Platform",
                "excerpt": "The European Union has kicked off the process of choosing between eight bidders that supply its 9-million-euro joint purchasing platform for critical minerals and energy,…",
                "keywords": [
                    "energy",
                    "supply"
                ],
                "published_date": "21 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "revenue",
                4
            ],
            [
                "production",
                3
            ],
            [
                "price",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Governors-Demand-Power-Price-Overhaul-As-Costs-Balloon-10-Fold.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating South Africa is negotiating with… Julianne Geiger Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info Five U.S. governors have demanded PJM Interconnection, the largest power grid operator in the U.S., revise its pricing system after its recent capacity auction delivered a staggering increase in power plant costs—up nearly 10-fold from last year—but PJM says the green transition is to blame. The auction, meant to secure enough electricity supply for 65 million people across 13 states, sent shockwaves through the market as PJM revealed the steep price tag for meeting rising demand amid dwindling supply. Households and businesses in the region are now facing costs of $14.7 billion, sparking urgent calls from governors to address the runaway pricing before it bleeds consumers dry. PJM says it warned policymakers that the pivot from fossil fuels to green energy without bolstering renewable capacity would pinch the grid. But the governors argue that it’s on PJM to widen the pool of power suppliers and rethink price caps to avoid these massive surges. With data-hungry AI centers and extreme weather pushing demand through the roof, PJM’s latest auction outcome is just the beginning of what could be years of high prices and strained supply. Power company stocks are already enjoying theprice hikesas they plan for fatter profits, but the PJM region’s residents are left holding the bill. A move by PJM to delay the 2026/27 auction by six months may give it time to respond to the complaint. For now, PJM’s price hike is a wake-up call that more reliable power is essential—and expensive. The domino effect is already hitting Wall Street, with power company stocks getting a boost as utilities anticipate profits from high demand and power capacity constraints. PJM's move to delay its next auction might buy regulators time, but the message is clear: between AI, extreme weather, and retirements, the U.S. grid is playing a dangerous game of catch-up. And for the 65 million residents in PJM territory, that means digging deeper into their pockets for electricity. By Julianne Geiger for Oilprice.com | Previous Post Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion Next Post Hess Beats Q3 Earnings Estimates On Robust Guyana Output Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 12:10",
        "author": "Julianne Geiger",
        "author_bio": "Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group.",
        "contributor_since": "12 Jan 2016",
        "other_articles": [
            {
                "heading": "New Survey Shows Grim Outlook For Oil Markets",
                "excerpt": "A Reuters poll released Thursday paints a lackluster future for oil in 2025, with a cocktail of sluggish demand growth and supply glut concerns pulling…",
                "keywords": [
                    "oil",
                    "demand",
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold",
                "excerpt": "Five U.S. governors have demanded PJM Interconnection, the largest power grid operator in the U.S., revise its pricing system after its recent capacity auction delivered…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Oil Traders Uncertain as OPEC+ Weighs December Surprise",
                "excerpt": "Oil traders can't seem to agree on where OPEC+ will steer production next, and it's anyone's guess if the cartel's December hike is still on…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Unexpected Crude, Product Draws Send Oil Prices Up",
                "excerpt": "Crude oil inventories in the United fell by 573,000 barrels for the week ending October 25, according to The American Petroleum Institute (API). Analysts had…",
                "keywords": [
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Russia's Arctic LNG 2 Project Put on Ice With No Restart Plans",
                "excerpt": "Russia's Novatek recently halted operations at its Arctic LNG 2 project, and it has no plans to restart it this winter, according to an anonymous…",
                "keywords": [],
                "published_date": "25 October 2024"
            },
            {
                "heading": "New Mexico Warns That Green Goals Will Stymie Oil Revenue",
                "excerpt": "New Mexico is evaluating new oil and gas drilling restrictions that have the potential to impact production and revenue in the coming years, according to…",
                "keywords": [
                    "oil",
                    "gas",
                    "revenue",
                    "production"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Oil Rig Count Dips as WTI Gains 2%",
                "excerpt": "The total number of active drilling rigs for oil and gas in the United States saw no change week, according to new data that Baker…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Valero Could Be Next To Shutter California Oil Refineries",
                "excerpt": "Last week, Phillips 66 said it would shut down its Los Angeles oil refinery by the end of next year. Now, refining peer Valero Energy…",
                "keywords": [
                    "oil",
                    "energy"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Norway's Oil Giant Sverdrup Set to Peak in 2025",
                "excerpt": "Norway's largest oilfield, Johan Sverdrup, is expected to come off its production peak by early 2025, according to operator Equinor. The field, a cornerstone of…",
                "keywords": [
                    "production"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Steady Despite Crude Inventory Build",
                "excerpt": "Crude oil inventories in the United rose by 1.643 million barrels for the week ending October 18, according to The American Petroleum Institute (API). Analysts…",
                "keywords": [
                    "oil"
                ],
                "published_date": "22 October 2024"
            },
            {
                "heading": "U.S. Tightens Grip on Russia's LNG Exports",
                "excerpt": "The U.S. is stepping up efforts to curb Russia's LNG exports as part of its broader strategy to cut off funds supporting Moscow's war in…",
                "keywords": [],
                "published_date": "22 October 2024"
            },
            {
                "heading": "Oil Gains as China Lifts Crude Import Quota",
                "excerpt": "Oil prices are on the rise, with West Texas Intermediate (WTI) at $71.78 per barrel and Brent crude at $75.53 on Tuesday morning. Both key…",
                "keywords": [
                    "oil",
                    "rise",
                    "barrel"
                ],
                "published_date": "22 October 2024"
            },
            {
                "heading": "From Wealth to Windows: Russian Oil Executives Meet a Grim Fate",
                "excerpt": "Mikhail Rogachev, a prominent figure in Russia's oil industry and former vice president of the now-defunct Yukos, has become the latest in a string of…",
                "keywords": [
                    "oil"
                ],
                "published_date": "21 October 2024"
            },
            {
                "heading": "Iran Readies New Oil Outlet To Bypass the Strait of Hormuz",
                "excerpt": "Iran is closer to finding a way to circumvent the crucial Strait of Hormuz when it comes to oil exports. The Jask oil terminal, officially…",
                "keywords": [
                    "oil"
                ],
                "published_date": "18 October 2024"
            },
            {
                "heading": "U.S. Drilling Activity Stumbles As Prices Remain Volatile",
                "excerpt": "The total number of active drilling rigs for oil and gas in the United States fell this week, according to new data that Baker Hughes…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "18 October 2024"
            },
            {
                "heading": "India Positions Itself for a Huge Petrochemical Boom",
                "excerpt": "India is positioning itself for a petrochemical boom, with $87 billion expected over the next decade to meet surging demand. As more of its citizens…",
                "keywords": [
                    "demand"
                ],
                "published_date": "18 October 2024"
            },
            {
                "heading": "Pemex Budget Cuts Threaten Oil Production",
                "excerpt": "Mexico’s state-owned oil giant, Pemex, is facing a significant reduction in its upstream budget for the fourth quarter. According to internal documents, the company plans…",
                "keywords": [
                    "oil"
                ],
                "published_date": "17 October 2024"
            },
            {
                "heading": "Oil Jumps After API Reports Draws in Crude and Fuel Inventories",
                "excerpt": "Crude oil inventories in the United fell by 1.58 million barrels for the week ending October 11, according to The American Petroleum Institute (API). Analysts…",
                "keywords": [
                    "oil"
                ],
                "published_date": "16 October 2024"
            },
            {
                "heading": "US Oil Producers Rush to Hedge",
                "excerpt": "US oil producers have taken advantage of the recent surge in crude prices, locking in future sales to safeguard their revenue. Rising tensions between Iran…",
                "keywords": [
                    "oil",
                    "revenue"
                ],
                "published_date": "15 October 2024"
            },
            {
                "heading": "Japan's TEPCO Looks to Make Hydrogen with Geothermal Power",
                "excerpt": "Tokyo Electric Power Co. Holdings (TEPCO) is making strides in the renewable energy sector by planning to produce hydrogen using geothermal power in Indonesia. In…",
                "keywords": [
                    "energy"
                ],
                "published_date": "15 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "price",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Russias-Gazprom-Boosts-2024-Investments-to-169-Billion.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Oil prices failed to recover… Charles Kennedy Charles is a writer for Oilprice.com More Info Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the Russian gas giantsaidafter approving its new financial plan for the year. Previously, Gazprom was targeting investments of a total of $16.5 billion (1.574 trillion rubles) for 2024. The Russian company continues to develop key projects, including such aimed at boosting natural gas supply to China, Famil Sadygov, Deputy Chairman of the Management Committee at Gazprom, said in a statement carried by Russian news agency TASS. Gazprom still exports natural gas via pipelines to Europe, via a link crossing Ukraine, and through the TurkStream pipeline. The customers are several countries in central Europe. Russia has seen its gas exports to Europe significantly reduced since the invasion of Ukraine. The major drop in Gazprom’s gas deliveries was due to the halt of Russian pipeline gas exports to nearly all European countries. Weeks after the Russian invasion of Ukraine in early 2022, Russia cut off supply to Poland, Bulgaria, and Finland. Then Gazprom started to reduce supply via the Nord Stream pipeline to Germany in June 2022, claiming an inability to service gas turbine maintenance outside Russia due to the Western sanctions against Moscow for the invasion of Ukraine. This was weeks before the sabotage of the Nord Stream pipelines at the end of September 2022, which definitively closed all pipeline gas routes of Russia’s gas to Germany. Before the war in Ukraine, Russia supplied around one-third of all the gas to Europe. With most of European markets now closed, Russiaappears to be strugglingto convince China to take on more pipeline gas. Beijing is not committing to a massive new pipeline project to import Russian pipeline gas unless it’s favorable for the world’s second-largest economy. But Gazprom is pressing on andis acceleratingits natural gas exports to China through the existing Power of Siberia pipeline, aiming to hit maximum capacity by the end of 2024—a full year ahead of schedule. By Charles Kennedy for Oilprice.com | Previous Post Investment Giants Form $50-Billion AI and Power Partnership Next Post U.S. Governors Demand Power Price Overhaul As Costs Balloon 10 Fold Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 10:44",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "economy",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "price",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Investment Giants Form $50-Billion AI and Power Partnership",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Investment-Giants-Form-50-Billion-AI-and-Power-Partnership.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Egypt, a major energy player… Charles Kennedy Charles is a writer for Oilprice.com More Info Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a$50 billionstrategic partnership to invest in data centers and power generation to support the growth of artificial intelligence (AI). Energy Capital Partners, the largest private owner of power generation and renewables in the United States, will collaborate with KKR to speed up the development of data center infrastructure and power generation and transmission infrastructure to back the rapid expansion of AI and cloud computing globally. The $50-billion bet from the two major investors highlights the momentum behind AI over the past two years. As a result of the advance in AI and the need for numerous data centers to support its development, power demand is expected to grow in the coming decade, including in the United States. Thanks to the partnership, KKR and ECP plan to engage with industry leaders including utilities, power and data center developers, and independent power producers to accelerate the delivery of data center campuses required by hyperscalers. “In order for the U.S. to maintain its advantage in AI, we will need massive new investments in power infrastructure on an accelerated basis that are capable of addressing concerns related to electricity prices and carbon emissions,” Doug Kimmelman, Founder and Senior Partner, ECP, said in a statement. “We are committed to delivering solutions for our strategic partners and our investors through ECP’s strong utility relationships and expertise investing across a wide variety of power generation, renewable, and battery storage assets.” Commenting on the AI and data center boom, Kimmelman toldThe Wall Street Journal, “The capital needs are huge, and one of the big bottlenecks—maybe the bottleneck—is electricity availability.” ECP believes that natural gas power plants could support much of the needed new generation capacity. U.S. power-generating companiesare announcing plansfor the highest volume of new natural gas-fired capacity in years as the AI boom is driving demand for electricity. By Charles Kennedy for Oilprice.com | Previous Post Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE Next Post Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 09:20",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Vietnamese-EV-Maker-Gets-1-Billion-in-Funding-Led-by-UAE.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Recent breakthroughs in nuclear fusion… Charles Kennedy Charles is a writer for Oilprice.com More Info Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s leading driver training and road safety institute, Bloombergreportedon Wednesday, quoting a source with knowledge of the agreement. VinFast and its parent company, Vingroup, earlier this weeksigned strategic partnershipswith companies in the Middle East during an official visit of Vietnamese Prime Minister Pham Minh Chinh to the United Arab Emirates (UAE). The memoranda of understanding (MOUs) cover strategic areas, including maritime development and shipyard building capabilities, sustainable coastal land utilization, digital transformation, and collaboration in electric vehicles and green transportation, VinFast said. Under the deal between VinFast and Emirates Driving Company, EDC will lead a consortium investing in VinFast. In addition to gaining access to funding, VinFast will benefit from EDC’s expertise in driver training and road safety, supporting the development of a comprehensive EV ecosystem, the Vietnamese automaker said. “This partnership aims to enhance global electric vehicle production, meet the growing demand for green transportation, increase road safety awareness, and reaffirm EDC’s commitment to contributing to the Middle East’s green transportation revolution, addressing environmental and climate challenges,” VinFast added. Also this week, VinFast Autoofficially launchedin the Middle Eastern market as part of the company’s international expansion strategy. While working on expanding EV manufacturing, Vietnam seeks closer cooperation with the Middle East in fuel supply and distribution. Saudi oil giant Aramco is seeking to invest in oil refining and fuel distribution in the Southeast Asian country, where economic growth has exceeded the global average in recent years. “Vietnam has great potential in the region, therefore, Aramco wishes to invest in oil refinery and petrol distribution in the country,” the government of Vietnamsaidin a statement carried by Reuters. On Wednesday, Aramcosigneda collaboration framework agreement with Vietnam Oil and Gas Group (Petrovietnam) to explore opportunities for cooperation in storage and the supply and trading of energy and petrochemical products. By Charles Kennedy for Oilprice.com | Previous Post The West Needs Incentives to Cut Russian Nuclear Fuel Dependence Next Post Investment Giants Form $50-Billion AI and Power Partnership Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 08:55",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "production",
                3
            ],
            [
                "investment",
                3
            ],
            [
                "demand",
                2
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/The-West-Needs-Incentives-to-Cut-Russian-Nuclear-Fuel-Dependence.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Armenia and Azerbaijan are nearing… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French company Orano, one of the top Western suppliers of enriched uranium. “To entirely disconnect from Russia, we need new capacities, and industrial groups will only invest if they have long-term contracts,” Orano’s CEO Nicolas Maes told theFinancial Timesin an interview published on Wednesday. France’s Orano and Urenco, a consortium created in 1970 by the governments of Germany, the Netherlands, and the UK, are the main Western competitors of Russia’s state-owned nuclear energy firm Rosatom. Europe has not sanctioned Rosatom or Russian nuclear fuel supplies as dozens of nuclear power stations in the eastern EU member states have been built by Russian companies and supplied with Russian nuclear fuel. A compromise sanctions measure hasn’t been agreed. As many countries are now looking to nuclear power to cut emissions and reliance on imports of oil and gas, they would need to cut their dependence on enriched uranium from Russia. But in order to reduce reliance on Russia, western contractors and suppliers would need visibility over the long-term demand, the chief executive of France’s Orano told FT. The executive also called for sanctions on the Russian nuclear sector, saying that “If there are no sanctions at all, we’ll see some electricity producers continue to get supplies from Russia as long as it’s possible.” Orano has started working with designers for small modular reactors (SMRs) and advanced modular reactors (AMRs), the companysaidearlier this month. “With the creation of two “sharing groups”, Orano is acting as a strategic partner for start-ups working on the development of AMRs,” said the French company. France, where nuclear power dominates electricity generation, has been looking to build SMRs and other types of next-generation reactors. By Tsvetana Paraskova for Oilprice.com | Previous Post Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million Next Post Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 08:03",
        "author": "Tsvetana Paraskova",
        "author_bio": "Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews.",
        "contributor_since": "13 Jul 2016",
        "other_articles": [
            {
                "heading": "The U.S. LNG Export Boom Faces Challenges",
                "excerpt": "The U.S. LNG export industry has recently hit several stumbling blocks. And who will be America’s president in the next four years may not even…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Panama Canal Bets on Asian Demand to Boost Flailing LNG Traffic",
                "excerpt": "After a year of traffic restrictions and upended global trade flows due to geopolitical shifts, the Panama Canal – the fastest route for American LNG…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
                "excerpt": "The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and…",
                "keywords": [
                    "energy",
                    "decline"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
                "excerpt": "Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergies reported…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
                "excerpt": "Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
                "excerpt": "Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak…",
                "keywords": [
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
                "excerpt": "The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French…",
                "keywords": [
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
                "excerpt": "A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
                "excerpt": "Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Times…",
                "keywords": [
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
                "excerpt": "Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Vows to Maintain Its Status as an Oil Giant",
                "excerpt": "As Saudi Arabia prepares to tender 44 gigawatts (GW) of renewable energy projects, it will continue to maintain its oil-producing potential to ensure global energy…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
                "excerpt": "Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply…",
                "keywords": [
                    "supply"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
                "excerpt": "Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil…",
                "keywords": [
                    "energy",
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
                "excerpt": "BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil…",
                "keywords": [
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Hydrogen Stocks Crash as Hype Faces Reality Check",
                "excerpt": "The low-carbon hydrogen hype has begun to fade in recent months as companies and investors realize that their ambitions face the reality of costly projects…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oman’s Oil Exploration Firm Plunges After Record $2-Billion IPO",
                "excerpt": "After a record $2-billion initial public offering, OQ Exploration and Production Company (OQEP), Oman’s wholly-state-owned upstream oil and gas operator, fell by more than 8%…",
                "keywords": [
                    "oil",
                    "gas",
                    "production"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China’s Oil Giant CNOOC Books Record Q3 Profit as Production Jumps",
                "excerpt": "Despite lower international oil prices, Chinese state-held oil and gas giant CNOOC reported on Monday its highest-ever profit for the third quarter, on the back…",
                "keywords": [
                    "oil",
                    "gas",
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "PetroChina Set to Close Its Biggest Refinery in 2025",
                "excerpt": "State oil giant PetroChina plans to shut its largest Chinese refinery in 2025 after years of considering moving the processing to a smaller site, anonymous…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China Ramps Up Coal Power as Energy Demand Surges",
                "excerpt": "Although the share of coal in China’s electricity generation has been declining in recent years with the renewables boom, Chinese coal power generation and demand…",
                "keywords": [
                    "demand"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "EU and China Continue Talks on EV Tariffs Alternative",
                "excerpt": "The European Union and China agreed on Friday to continue discussions on a possible alternative to the EU import tariffs on China-made electric vehicles, a…",
                "keywords": [],
                "published_date": "25 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ],
            [
                "demand",
                2
            ]
        ]
    },
    {
        "headline": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Gazprom-Unit-Sues-Industrial-Gases-Giant-Linde-for-884-Million.html",
        "content": "Aston Martin's Pre-Tax Losses Plummet by 90% in Q3 US News & World Report's… Tsvetana Paraskova Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim over Linde’s withdrawal from a gas processing plant in east Russia. The subsidiary of Gazprom, which operates the new Amur Gas Processing Plant, has filed the claim at the Arbitration Court of the Amur Region in Russia, Reutersreportedon Wednesday, citing court documents it had seen. Following the Russian invasion of Ukraine, Germany-based Linde said in 2022 that it would withdraw from Russia, suspend all developments, sell industrial assets, and terminate supply to certain customers. In June 2022, Lindeendedits participation in the Amur gas processing complex, which is part of the Russian network of natural gas exports via the Power of Siberia pipeline to China. Two years earlier, Lindehad won a contractto provide engineering, procurement, and site services based on its proprietary technology for the cracker unit of SIBUR's Amur Gas Chemical Complex. Companies in Russia have filed several claims against Linde since the Western firm announced its withdrawal from the country two years ago. Most recently, a Russian court in Augustorderedthat assets worth $1.15 billion of a Linde subsidiary in the UK be frozen, as part of a dispute over another gas processing plant, the Ust-Luga complex. Linde signed in 2021 an engineering, procurement and construction (EPC) contract with Gazprom for the complex. Gazprom is involved in many other lawsuits and claims over previous contracts for supply of services or goods. In June, an arbitration tribunal awarded German energy giant Uniper theright to terminateits long-term Russian gas supply contracts and awarded it more than $14.1 billion (13 billion euros) in damages for the gas volumes that Gazprom Export has not supplied since the middle of 2022. By Tsvetana Paraskova for Oilprice.com | Previous Post Chinese Oil Major to Explore Iraqi Field Next Post The West Needs Incentives to Cut Russian Nuclear Fuel Dependence Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews. More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 07:33",
        "author": "Tsvetana Paraskova",
        "author_bio": "Tsvetana is a writer for Oilprice.com with over a decade of experience writing for news outlets such as iNVEZZ and SeeNews.",
        "contributor_since": "13 Jul 2016",
        "other_articles": [
            {
                "heading": "The U.S. LNG Export Boom Faces Challenges",
                "excerpt": "The U.S. LNG export industry has recently hit several stumbling blocks. And who will be America’s president in the next four years may not even…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Panama Canal Bets on Asian Demand to Boost Flailing LNG Traffic",
                "excerpt": "After a year of traffic restrictions and upended global trade flows due to geopolitical shifts, the Panama Canal – the fastest route for American LNG…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Cheniere Energy Q3 Earnings Dip on Lower LNG and Gas Prices",
                "excerpt": "The biggest U.S. LNG exporter, Cheniere Energy Inc (NYSE: LNG), reported on Thursday a decline in third-quarter revenues and profits amid decreased market volatility and…",
                "keywords": [
                    "energy",
                    "decline"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "TotalEnergies Misses Profit Forecast on Weak Refining and Low Oil Prices",
                "excerpt": "Weak refining margins, lower LNG production, and declining oil prices weighed on the third-quarter earnings of TotalEnergies (NYSE: TTE), which came below expectations. TotalEnergies reported…",
                "keywords": [
                    "oil",
                    "production"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "IMF Cuts Middle East Growth Outlook on Oil Output Cuts and Conflicts",
                "excerpt": "Economic growth in the Middle East and North Africa is expected to remain sluggish at 2.1% this year, amid ongoing conflicts and prolonged OPEC+ oil…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Shell Beats Expectations as Strong Gas Sales Offset Weak Refining",
                "excerpt": "Shell (NYSE: SHEL) reported on Thursday better-than-expected earnings for the third quarter on the back of strong performance in its gas division which offset weak…",
                "keywords": [
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "The West Needs Incentives to Cut Russian Nuclear Fuel Dependence",
                "excerpt": "The Western countries will need additional incentives and sanctions on Russia to reduce their dependence on the Russian supply of nuclear fuel, according to French…",
                "keywords": [
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million",
                "excerpt": "A unit of Russian gas giant Gazprom is suing Linde, the world’s largest industrial gases company, in an $884 million (85.7 billion Russian rubles) claim…",
                "keywords": [
                    "gas"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Ukraine and Russia Discuss Halting Attacks on Energy Sites",
                "excerpt": "Russia and Ukraine are in the very early stages of Qatar-mediated talks about halting attacks on each other’s energy facilities and infrastructure, the Financial Times…",
                "keywords": [
                    "energy"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Lukoil’s Trading Arm Looks to Revive U.S. Business",
                "excerpt": "Litasco, the international oil trading and shipping firm owned by Russian oil company Lukoil, is looking to rebuild its business in the Americas by arranging…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Saudi Arabia Vows to Maintain Its Status as an Oil Giant",
                "excerpt": "As Saudi Arabia prepares to tender 44 gigawatts (GW) of renewable energy projects, it will continue to maintain its oil-producing potential to ensure global energy…",
                "keywords": [
                    "energy",
                    "oil"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Nigeria Discusses Crude and Fuel Supply with Africa’s Top Refinery",
                "excerpt": "Aliko Dangote, Africa’s richest person and the owner of the continent’s newest and biggest refinery, is discussing crude supply to the refinery and fuel supply…",
                "keywords": [
                    "supply"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Austria’s OMV Profit Slumps on Weak Oil Trading and Refining",
                "excerpt": "Austrian energy company OMV reported a lower-than-expected net profit for the third quarter as stronger chemicals sales and margins could not fully offset weaker oil…",
                "keywords": [
                    "energy",
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "BP Earnings Top Forecasts Despite Weaker Oil Prices and Refining",
                "excerpt": "BP (NYSE: BP) booked third-quarter earnings above analyst expectations, although the profit was lower from a year earlier and the second quarter amid weaker oil…",
                "keywords": [
                    "oil",
                    "profit"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Hydrogen Stocks Crash as Hype Faces Reality Check",
                "excerpt": "The low-carbon hydrogen hype has begun to fade in recent months as companies and investors realize that their ambitions face the reality of costly projects…",
                "keywords": [],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Oman’s Oil Exploration Firm Plunges After Record $2-Billion IPO",
                "excerpt": "After a record $2-billion initial public offering, OQ Exploration and Production Company (OQEP), Oman’s wholly-state-owned upstream oil and gas operator, fell by more than 8%…",
                "keywords": [
                    "oil",
                    "gas",
                    "production"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China’s Oil Giant CNOOC Books Record Q3 Profit as Production Jumps",
                "excerpt": "Despite lower international oil prices, Chinese state-held oil and gas giant CNOOC reported on Monday its highest-ever profit for the third quarter, on the back…",
                "keywords": [
                    "oil",
                    "gas",
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "PetroChina Set to Close Its Biggest Refinery in 2025",
                "excerpt": "State oil giant PetroChina plans to shut its largest Chinese refinery in 2025 after years of considering moving the processing to a smaller site, anonymous…",
                "keywords": [
                    "oil"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "China Ramps Up Coal Power as Energy Demand Surges",
                "excerpt": "Although the share of coal in China’s electricity generation has been declining in recent years with the renewables boom, Chinese coal power generation and demand…",
                "keywords": [
                    "demand"
                ],
                "published_date": "27 October 2024"
            },
            {
                "heading": "EU and China Continue Talks on EV Tariffs Alternative",
                "excerpt": "The European Union and China agreed on Friday to continue discussions on a possible alternative to the EU import tariffs on China-made electric vehicles, a…",
                "keywords": [],
                "published_date": "25 October 2024"
            }
        ],
        "keywords": [
            [
                "energy",
                5
            ],
            [
                "oil",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "supply",
                2
            ]
        ]
    },
    {
        "headline": "Chinese Oil Major to Explore Iraqi Field",
        "link": "https://oilprice.com/Latest-Energy-News/World-News/Chinese-Oil-Major-to-Explore-Iraqi-Field.html",
        "content": "Oil Prices Rebound, But Henry Hub Nat Gas Still Taking a Beating Baghdad is actively working to… Charles Kennedy Charles is a writer for Oilprice.com More Info China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be managed by a fully owned subsidiary of the Chinese company, CNOOC Africa Holding, with the first phase of the work planned to take three years, Reutersreported. The dealfollowsCNOOC’s winning bid for Block 7 following a tender that the Iraqi government carried out earlier this year, where Chinese energy majors were the big winners, winning a total of four bids for nine oil and gas deposits. Chinese companies’ entry into Iraq’s oil and gas sector is a result of an agreement inked back in 2019 and dubbed “Oil for Reconstruction and Investment”, under which Chinese companies are granted entry into Iraq’s energy infrastructure sector as investors in return for oil supplies. In addition to this agreement, Iraq’s government sought to stimulate more foreign investment in its oil and gas resources by changing the mechanism used to share profits from exploration and production activities. Previously, Iraq offered foreign energy investors a technical service contract, which paid a flat fixed rate to the producing companie for every barrel they extracted. This was considered sub-optimal by the producers since it meant that they could not make more money when oil prices went higher and at the same time had to shoulder any upward changes in production costs. Since this led to a pullout by some supermajors, Iraq decided to offer those still in the country and potential new entrants a profit-sharing agreement mechanism that did not feature the above problems with costs and market price advantages. It was this change in contract terms that convinced TotalEnergies to sign a massive $27-billion deal with the Iraqi authorities for the development of the country’s natural gas reserves, as well as solar power capacity. By Charles Kennedy for Oilprice.com | Previous Post Oil Prices Remain Subdued on the Prospect of an Israel-Lebanon Ceasefire Next Post Gazprom Unit Sues Industrial Gases Giant Linde for $884 Million Charles is a writer for Oilprice.com More Info Valero Could Be Next To Shutter California Oil Refineries Iran's Oil Exports: On a Slow Boat to Nowhere Surprise Crude Inventory Spike Slams Oil Prices Iran’s Oil Tankers Flee Biggest Export Terminal Fearing Israeli Attack Iran Readies New Oil Outlet To Bypass the Strait of Hormuz Why Is Smart Money Betting Against Renewable Energy Draws Across the Board Bolster Oil Prices Coal Remains On Its Throne Despite Transition Push China’s Oil and Steel Industries Are in the Red. What Now? only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record:",
        "date": "Oct 30, 2024 at 06:09",
        "author": "Charles Kennedy",
        "author_bio": "Charles is a writer for Oilprice.com",
        "contributor_since": "29 Sep 2011",
        "other_articles": [
            {
                "heading": "Record Shale Production Helps ConocoPhillips Beat Profit Estimates",
                "excerpt": "ConocoPhillips (NYSE: COP) is raising its ordinary dividend and share buyback program as its third-quarter earnings beat market expectations on the back of higher total…",
                "keywords": [],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Rosneft to Resume Output at Idled Black Sea Refinery in November",
                "excerpt": "Rosneft plans to resume crude processing at its Tuapse oil refinery on Russia’s Black Sea coast in November, after idling it for a month because…",
                "keywords": [
                    "oil"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Canadian Natural Resources Q3 Profit Slips as Oil and Gas Prices Fall",
                "excerpt": "Canada’s largest oil and gas producer, Canadian Natural Resources (NYSE: CNQ), reported lower adjusted net earnings from operations for the third quarter compared to a…",
                "keywords": [
                    "oil",
                    "gas"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Exelon Reports 80% Surge in Data Center Power Supply Deals",
                "excerpt": "Exelon has seen an 80% increase in power supply deals coming from data enter operators in the latest sign that the IT industry is driving…",
                "keywords": [
                    "supply"
                ],
                "published_date": "31 October 2024"
            },
            {
                "heading": "Russia’s Gazprom Boosts 2024 Investments to $16.9 Billion",
                "excerpt": "Gazprom is raising its investment plan for 2024 by 4% to $16.9 billion (1.642 trillion Russian rubles), thanks to rising exports and domestic supply, the…",
                "keywords": [
                    "investment",
                    "supply"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Investment Giants Form $50-Billion AI and Power Partnership",
                "excerpt": "Global investment firm KKR and private-equity giant Energy Capital Partners on Wednesday announced a $50 billion strategic partnership to invest in data centers and power…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Vietnamese EV Maker Gets $1 Billion in Funding Led by UAE",
                "excerpt": "Vietnam’s electric vehicle manufacturer VinFast Auto is expected to receive at least $1 billion in overseas funding led by Emirates Driving Company (EDC), Abu Dhabi’s…",
                "keywords": [],
                "published_date": "30 October 2024"
            },
            {
                "heading": "Chinese Oil Major to Explore Iraqi Field",
                "excerpt": "China’s CNOOC has inked a deal for exploration at an oil field in central Iraq, the company said today. The deposit, Block 7, will be…",
                "keywords": [
                    "oil"
                ],
                "published_date": "30 October 2024"
            },
            {
                "heading": "TotalEnergies to Produce More Gas Condensate Offshore Denmark",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "Phillips 66 Beats Analyst Estimates Despite Earnings Dip in Q3",
                "excerpt": "U.S. refining and chemicals giant Phillips 66 (NYSE: PSX) booked higher-than-expected earnings for the third quarter even if earnings plunged from a year earlier, as…",
                "keywords": [],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UK Offshore Oil Platform Halted Due to Gas Compressor Issue",
                "excerpt": "Production via the Triton Floating Production Storage & Offloading (FPSO) vessel in the UK North Sea has been halted due to a problem with the…",
                "keywords": [
                    "production"
                ],
                "published_date": "29 October 2024"
            },
            {
                "heading": "UAE’s Renewable Energy Giant Pushes Back Green Hydrogen Targets",
                "excerpt": "Masdar, the clean energy giant of the United Arab Emirates (UAE), has pushed back its target to reach 1 million tons per year of green…",
                "keywords": [
                    "energy"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Profit at India’s Top Refiner Slumps by 99% Due to Weak Margins",
                "excerpt": "IndianOil, the biggest refiner in India, reported on Monday a net profit tumbling by 98.6% in the quarter to September from a year ago amid…",
                "keywords": [
                    "profit"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "Average U.S. Gasoline Price Set to Drop Below $3 for the First Time Since 2021",
                "excerpt": "The U.S. national average price of gasoline is set to soon fall below $3 per gallon for the first time since 2021, amid lower seasonal…",
                "keywords": [
                    "price"
                ],
                "published_date": "28 October 2024"
            },
            {
                "heading": "FERC Grants Exxon and Qatar Three-Year Extension to Build Golden Pass LNG",
                "excerpt": "The U.S. Federal Energy Regulatory Commission has granted a three-year extension to ExxonMobil and QatarEnergy to build their $10-billion Golden Pass LNG export plant in…",
                "keywords": [
                    "energy"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Cepsa: Windfall Tax Would Delay Its $3.3-Billion Hydrogen Plan",
                "excerpt": "Cepsa, Spain’s second-largest oil company, will delay its $3.25 billion (3 billion euros) investment into domestic green hydrogen projects if Spain makes the windfall tax…",
                "keywords": [
                    "oil",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "South Africa Seeks Loan Guarantees for Energy Transition Funding",
                "excerpt": "South Africa is currently negotiating loan guarantees with its international partners in its $9.3-billion Just Energy Transition Partnership (JETP) program for energy investment. The International…",
                "keywords": [
                    "energy",
                    "investment"
                ],
                "published_date": "25 October 2024"
            },
            {
                "heading": "Saudi Oil Export Revenues Hit Three-Year Low as Prices Decline",
                "excerpt": "Lower crude oil prices dragged Saudi Arabia’s oil export revenues to the lowest level in more than three years in August, amid underwhelming oil demand…",
                "keywords": [
                    "oil",
                    "demand"
                ],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Tesla Stock Soars After Q3 Earnings Beat",
                "excerpt": "Tesla (NASDAQ: TSLA) saw its shares jump by 20% after hours on Wednesday and another 14% in pre-market trade on Thursday after reporting earnings for…",
                "keywords": [],
                "published_date": "24 October 2024"
            },
            {
                "heading": "Oil Refining Giant Valero Tops Estimates Despite Q3 Profit Plunge",
                "excerpt": "One of the biggest U.S. refiners, Valero Energy (NYSE: VLO), beat Wall Street estimates even as it reported a widely expected plunge in its third-quarter…",
                "keywords": [
                    "energy"
                ],
                "published_date": "24 October 2024"
            }
        ],
        "keywords": [
            [
                "oil",
                5
            ],
            [
                "energy",
                5
            ],
            [
                "gas",
                4
            ],
            [
                "profit",
                4
            ],
            [
                "investment",
                3
            ],
            [
                "production",
                3
            ],
            [
                "barrel",
                3
            ],
            [
                "price",
                3
            ]
        ]
    }
]